org/index.org
# -*- mode:org; coding: utf-8; -*-
#+TITLE: Prady runcom
#+SETUPFILE: header.org
#+PROPERTY: header-args :mkdirp t :results no :eval no
#+auto_tangle: t

* Prady_runcom
** What's this?
- A compilation of dot-files: default variables, custom functions, aliases.
- *My* configuration backup, "[[https://git-scm.com/docs/git-push][push]]"ed to work as a template for yours.

*** Aim
- Cross-machine synchronization (hence, git)
- Modularity (hence, not a single file)
- Self-documenting (hence org files)
- Work-flow speed (obviously)
- "Pretty" low resource load (hence, not GNOME/KDE)

*** Non-aim
- Ease

** Will you be able to set this up?
Probably [[file:setup.org::*Knowledge][*NOT*]].
If you insist, check [[file:setup.org][setup]] instructions.
#+begin_important
Read till the end before you decide to set this up.
#+end_important

* Copyright/License Header
Copyright (c) 2020-2023 Pradyumna Paranjape

This file is part of Prady_runcom.

Prady_runcom is free software: you can redistribute it and/or modify
it under the terms of the GNU General Public License as published by
the Free Software Foundation, either version 3 of the License, or
(at your option) any later version.

Prady_runcom is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU General Public License for more details.

You should have received a copy of the GNU General Public License
along with Prady_runcom.  If not, see <https://www.gnu.org/licenses/>.

* Structure
Following configuration files are available. This literate configuration tangles their contents.
|------------------------------------------------+-------+--------+---------|
| Configuration File Path                        | POSIX | Stowed | Owner   |
|------------------------------------------------+-------+--------+---------|
| =/etc/profile=                                   | yes   | no     | root    |
| =/etc/bashrc=                                    | yes   | no     | root    |
| =/etc/zshrc=                                     | yes   | no     | root    |
| =/etc/profile.d/*=                               | yes   | no     | root    |
| =${HOME}/.bashrc=                                | no    | yes    | =${USER}= |
| =${HOME}/.zshrc=                                 | no    | yes    | =${USER}= |
| =${HOME}/.bash_profile=                          | yes   | yes    | =${USER}= |
| =${HOME}/.bash_login=                            | yes   | yes    | =${USER}= |
| =${HOME}/.profile=                               | yes   | yes    | =${USER}= |
| =${HOME}/.zprofile=                              | yes   | yes    | =${USER}= |
| =${HOME}/.zshenv=                                | yes   | yes    | =${USER}= |
| =${HOME}/.zlogin=                                | yes   | yes    | =${USER}= |
| =${RUNCOMDIR}/env/shrc=                          | yes   | no     | RUNCOM  |
| =${RUNCOMDIR}/env/ui=                            | yes   | no     | RUNCOM  |
| =${XDG_DATA_HOME}/bash-completion/completions/*= | no    | yes    | =${USER}= |
| =${XDG_CONFIG_DIR}=                              | no    | yes    | =${USER}= |
| =${XDG_CONFIG_HOME}/local.d/.*rc=                | yes   | no     | =${USER}= |
| =${XDG_CONFIG_HOME}/pvt.d/.*rc=                  | yes   | pvt    | =${USER}= |
|------------------------------------------------+-------+--------+---------|
They are loaded in following order.

** Bash
*** /etc/profile
**** /etc/bashrc
***** /etc/profile.d/*

*** ${HOME}/.bash_profile
**** ${HOME}/.profile

**** ${HOME}/.bashrc
****** ${RUNCOMDIR}/env/shrc
******* ${XDG_CONFIG_HOME}/local.d/*
******* ${XDG_CONFIG_HOME}/pvt.d/*

**** ${HOME}/.bash_login
****** ${RUNCOMDIR}/env/ui

** Zsh
*** /etc/profile
**** /etc/zshrc
***** /etc/profile.d/*

*** ${HOME}/.zshenv

*** ${HOME}/.zprofile
**** ${HOME}/.profile

*** ${HOME}/.zshrc
***** ${RUNCOMDIR}/env/shrc
****** ${XDG_CONFIG_HOME}/local.d/*
****** ${XDG_CONFIG_HOME}/pvt.d/*

*** ${HOME}/.zlogin
***** ${RUNCOMDIR}/env/ui

