docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-21 Fri 16:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Prady runcom</title>
<meta name="author" content="Pradyumna Paranjape" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Prady runcom</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org044e268">Prady_runcom</a>
<ul>
<li><a href="#org73d7c83">What&rsquo;s this?</a></li>
<li><a href="#orgf93d100">Will you be able to set this up?</a></li>
</ul>
</li>
<li><a href="#org6a5df9c">Copyright/License Header</a></li>
<li><a href="#org2f57bdd">Structure</a>
<ul>
<li><a href="#org0644b4b">Bash</a></li>
<li><a href="#orgffdb411">Zsh</a></li>
</ul>
</li>
<li><a href="#orgccb6503">Headers</a></li>
<li><a href="#orgfd94ff3">Profiles</a></li>
<li><a href="#org0d086fc">Init</a>
<ul>
<li><a href="#org91bf4ad">profile</a></li>
<li><a href="#org8b833fc">bash</a></li>
<li><a href="#org9b07b78">zsh</a></li>
</ul>
</li>
<li><a href="#org5a76810">Inherit</a>
<ul>
<li><a href="#org6aaa260">bash</a></li>
<li><a href="#orgcc7d06a">zsh</a></li>
<li><a href="#org4e9f0e5">shrc</a></li>
</ul>
</li>
<li><a href="#orgd003abe">Better alternatives</a>
<ul>
<li><a href="#orgfc89766">Alias-er script</a></li>
<li><a href="#org9d285a7">alias commands</a></li>
<li><a href="#orgd18599b">Atuin</a></li>
<li><a href="#org29496ae">List Contents</a></li>
</ul>
</li>
<li><a href="#org77dc0c1">Variables</a>
<ul>
<li><a href="#org9e1b647">XDG</a></li>
<li><a href="#org2092bfe">PATH</a></li>
<li><a href="#org55a741f">Editor wars</a></li>
<li><a href="#orge5611e1">C(++) exports</a></li>
<li><a href="#orgae2b4d4">CARGO (Rust) exports</a></li>
<li><a href="#org49eca7e">GPU exports</a></li>
<li><a href="#orgd6a797a">Bemenu exports</a></li>
<li><a href="#orgc5e4d21">GTK+ debugging output</a></li>
</ul>
</li>
<li><a href="#org84f45e7">Functions</a>
<ul>
<li><a href="#org9aee8a7">Python</a></li>
<li><a href="#org1231eae">Vterm printf</a></li>
<li><a href="#org0ea56db">Vterm message passing</a></li>
<li><a href="#org57c6a1c">Git</a></li>
<li><a href="#org5b5b96b">Prompt String</a></li>
<li><a href="#org6606f63">Mathematical</a></li>
<li><a href="#orga3d863b">Documents compilation</a></li>
<li><a href="#org8d159b4">Mount over ssh</a></li>
<li><a href="#org0749203">Launch GUI</a></li>
<li><a href="#org9806d80">Un-Compress by context</a></li>
<li><a href="#org93ab6ea">Navigate</a></li>
<li><a href="#orgb61ed4d">zwc</a></li>
<li><a href="#org139c4d9">disable auto-venv</a></li>
<li><a href="#orgca09949">lszcat</a></li>
<li><a href="#orgad2eb9f">Manual pages</a></li>
<li><a href="#org9acaa36">Selection menu</a></li>
</ul>
</li>
<li><a href="#org0e4df57">Aliases</a>
<ul>
<li><a href="#orga759f52">manual page help</a></li>
<li><a href="#org4fbce1b">Network</a></li>
<li><a href="#org783aa21">Monitor Job queues</a></li>
<li><a href="#org16650f3">Lazy single-handed exit</a></li>
<li><a href="#orgf141917">[z]wc</a></li>
<li><a href="#org062e1ad">Encrypted cURL</a></li>
</ul>
</li>
<li><a href="#org77fb127">Networking</a>
<ul>
<li><a href="#orgb8242bf">State</a></li>
<li><a href="#org65c887e">SSH Agent</a></li>
</ul>
</li>
<li><a href="#org7fe7af3">Window Manager settings</a>
<ul>
<li><a href="#orge98954c">Terminal</a></li>
<li><a href="#org289ce2d">Sway exports</a></li>
<li><a href="#org34decd6">User Interface (GUI/CLI)</a></li>
</ul>
</li>
<li><a href="#orgabadca6">Calls</a>
<ul>
<li><a href="#org2b57e88">bash</a></li>
<li><a href="#org9b85299">zsh</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org044e268" class="outline-2">
<h2 id="org044e268">Prady_runcom</h2>
<div class="outline-text-2" id="text-org044e268">
</div>
<div id="outline-container-org73d7c83" class="outline-3">
<h3 id="org73d7c83">What&rsquo;s this?</h3>
<div class="outline-text-3" id="text-org73d7c83">
<ul class="org-ul">
<li>A compilation of dot-files: default variables, custom functions, aliases.</li>
<li><b>My</b> configuration backup, &ldquo;<a href="https://git-scm.com/docs/git-push">push</a>&rdquo;ed to work as a template for yours.</li>
</ul>
</div>

<div id="outline-container-org6b8fe40" class="outline-4">
<h4 id="org6b8fe40">Aim</h4>
<div class="outline-text-4" id="text-org6b8fe40">
<ul class="org-ul">
<li>Cross-machine synchronization (hence, git)</li>
<li>Modularity (hence, not a single file)</li>
<li>Self-documenting (hence org files)</li>
<li>Work-flow speed (obviously)</li>
<li>&ldquo;Pretty&rdquo; low resource load (hence, not GNOME/KDE)</li>
</ul>
</div>
</div>

<div id="outline-container-orgdfcf8e9" class="outline-4">
<h4 id="orgdfcf8e9">Non-aim</h4>
<div class="outline-text-4" id="text-orgdfcf8e9">
<ul class="org-ul">
<li>Ease</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgf93d100" class="outline-3">
<h3 id="orgf93d100">Will you be able to set this up?</h3>
<div class="outline-text-3" id="text-orgf93d100">
<p>
Probably <a href="setup.html#org0c1caa4"><b>NOT</b></a>.
If you insist, check <a href="setup.html">setup</a> instructions.
</p>
<div class="important" id="org6dabc8a">
<p>
Read till the end before you decide to set this up.
</p>

</div>
</div>
</div>
</div>

<div id="outline-container-org6a5df9c" class="outline-2">
<h2 id="org6a5df9c">Copyright/License Header</h2>
<div class="outline-text-2" id="text-org6a5df9c">
<p>
Copyright (c) 2020-2023 Pradyumna Paranjape
</p>

<p>
This file is part of Prady_runcom.
</p>

<p>
Prady_runcom is free software: you can redistribute it and/or modify
it under the terms of the GNU General Public License as published by
the Free Software Foundation, either version 3 of the License, or
(at your option) any later version.
</p>

<p>
Prady_runcom is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU General Public License for more details.
</p>

<p>
You should have received a copy of the GNU General Public License
along with Prady_runcom.  If not, see <a href="https://www.gnu.org/licenses/">https://www.gnu.org/licenses/</a>.
</p>
</div>
</div>

<div id="outline-container-org2f57bdd" class="outline-2">
<h2 id="org2f57bdd">Structure</h2>
<div class="outline-text-2" id="text-org2f57bdd">
<p>
Following configuration files are available. This literate configuration tangles their contents.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Configuration File Path</th>
<th scope="col" class="org-left">POSIX</th>
<th scope="col" class="org-left">Stowed</th>
<th scope="col" class="org-left">Owner</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>/etc/profile</code></td>
<td class="org-left">yes</td>
<td class="org-left">no</td>
<td class="org-left">root</td>
</tr>

<tr>
<td class="org-left"><code>/etc/bashrc</code></td>
<td class="org-left">yes</td>
<td class="org-left">no</td>
<td class="org-left">root</td>
</tr>

<tr>
<td class="org-left"><code>/etc/zshrc</code></td>
<td class="org-left">yes</td>
<td class="org-left">no</td>
<td class="org-left">root</td>
</tr>

<tr>
<td class="org-left"><code>/etc/profile.d/*</code></td>
<td class="org-left">yes</td>
<td class="org-left">no</td>
<td class="org-left">root</td>
</tr>

<tr>
<td class="org-left"><code>${HOME}/.bashrc</code></td>
<td class="org-left">no</td>
<td class="org-left">yes</td>
<td class="org-left"><code>${USER}</code></td>
</tr>

<tr>
<td class="org-left"><code>${HOME}/.zshrc</code></td>
<td class="org-left">no</td>
<td class="org-left">yes</td>
<td class="org-left"><code>${USER}</code></td>
</tr>

<tr>
<td class="org-left"><code>${HOME}/.bash_profile</code></td>
<td class="org-left">yes</td>
<td class="org-left">yes</td>
<td class="org-left"><code>${USER}</code></td>
</tr>

<tr>
<td class="org-left"><code>${HOME}/.bash_login</code></td>
<td class="org-left">yes</td>
<td class="org-left">yes</td>
<td class="org-left"><code>${USER}</code></td>
</tr>

<tr>
<td class="org-left"><code>${HOME}/.profile</code></td>
<td class="org-left">yes</td>
<td class="org-left">yes</td>
<td class="org-left"><code>${USER}</code></td>
</tr>

<tr>
<td class="org-left"><code>${HOME}/.zprofile</code></td>
<td class="org-left">yes</td>
<td class="org-left">yes</td>
<td class="org-left"><code>${USER}</code></td>
</tr>

<tr>
<td class="org-left"><code>${HOME}/.zshenv</code></td>
<td class="org-left">yes</td>
<td class="org-left">yes</td>
<td class="org-left"><code>${USER}</code></td>
</tr>

<tr>
<td class="org-left"><code>${HOME}/.zlogin</code></td>
<td class="org-left">yes</td>
<td class="org-left">yes</td>
<td class="org-left"><code>${USER}</code></td>
</tr>

<tr>
<td class="org-left"><code>${RUNCOMDIR}/env/shrc</code></td>
<td class="org-left">yes</td>
<td class="org-left">no</td>
<td class="org-left">RUNCOM</td>
</tr>

<tr>
<td class="org-left"><code>${RUNCOMDIR}/env/ui</code></td>
<td class="org-left">yes</td>
<td class="org-left">no</td>
<td class="org-left">RUNCOM</td>
</tr>

<tr>
<td class="org-left"><code>${XDG_DATA_HOME}/bash-completion/completions/*</code></td>
<td class="org-left">no</td>
<td class="org-left">yes</td>
<td class="org-left"><code>${USER}</code></td>
</tr>

<tr>
<td class="org-left"><code>${XDG_CONFIG_DIR}</code></td>
<td class="org-left">no</td>
<td class="org-left">yes</td>
<td class="org-left"><code>${USER}</code></td>
</tr>

<tr>
<td class="org-left"><code>${XDG_CONFIG_HOME}/local.d/.*rc</code></td>
<td class="org-left">yes</td>
<td class="org-left">no</td>
<td class="org-left"><code>${USER}</code></td>
</tr>

<tr>
<td class="org-left"><code>${XDG_CONFIG_HOME}/pvt.d/.*rc</code></td>
<td class="org-left">yes</td>
<td class="org-left">pvt</td>
<td class="org-left"><code>${USER}</code></td>
</tr>
</tbody>
</table>
<p>
They are loaded in following order.
</p>
</div>
