org/index.org
* Headers
Copyright, License banners
#+BEGIN_SRC sh :tangle ../env/shrc :exports none :noweb-ref posix-check
  # shellcheck shell=sh
#+end_src

#+BEGIN_SRC sh :tangle ../env/shrc :exports none :noweb-ref banner
  # -*- coding:utf-8; mode:shell-script; -*-
  #
  # Copyright (c) 2020-2023 Pradyumna Paranjape
  #
  # This file is part of Prady_runcom.
  #
  # Prady_runcom is free software: you can redistribute it and/or modify
  # it under the terms of the GNU General Public License as published by
  # the Free Software Foundation, either version 3 of the License, or
  # (at your option) any later version.
  #
  # Prady_runcom is distributed in the hope that it will be useful,
  # but WITHOUT ANY WARRANTY; without even the implied warranty of
  # MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  # GNU General Public License for more details.
  #
  # You should have received a copy of the GNU General Public License
  # along with Prady_runcom.  If not, see <https://www.gnu.org/licenses/>.
  #
  #===================================================================
  #  ___             _      ___                     _
  # | _ \_ _ __ _ __| |_  _| _ \__ _ _ _ __ _ _ _  (_)_ __  ___
  # |  _/ '_/ _` / _` | || |  _/ _` | '_/ _` | ' \ | | '_ \/ -_)
  # |_| |_| \__,_\__,_|\_, |_| \__,_|_| \__,_|_||_|/ | .__/\___|
  #                    |__/                      |__/|_|
  #===================================================================

#+end_src

#+BEGIN_SRC bash :tangle ../dotfiles/.bashrc :exports none :noweb-ref bash-check
  # shellcheck shell=bash
#+end_src

#+BEGIN_SRC bash :tangle ../dotfiles/.bashrc :exports none :noweb yes
  <<banner>>
#+END_SRC

#+BEGIN_SRC bash :tangle ../dotfiles/.zshrc :exports none :noweb yes
  <<bash-check>>
  <<banner>>
#+END_SRC

#+BEGIN_SRC bash :tangle ../dotfiles/.bash_login :exports none :noweb yes
  <<posix-check>>
  <<banner>>
#+END_SRC

#+BEGIN_SRC bash :tangle ../dotfiles/.zshenv :exports none :noweb yes
  <<posix-check>>
  <<banner>>
#+END_SRC

#+BEGIN_SRC bash :tangle ../dotfiles/.zlogin :exports none :noweb yes
  <<posix-check>>
  <<banner>>
#+END_SRC

#+BEGIN_SRC sh :tangle ../dotfiles/.profile :exports none :noweb yes
  <<posix-check>>
  <<banner>>
#+END_SRC

#+BEGIN_SRC sh :tangle ../env/ui :exports none :noweb yes
  <<posix-check>>
  <<banner>>
#+END_SRC

* Profiles
#+BEGIN_SRC bash :tangle ../dotfiles/.bash_profile
  if [ -f "${HOME}/.profile" ]; then
      # shellcheck disable=SC1091
      . "${HOME}/.profile"
  fi

  if [ -f "${HOME}/.bashrc" ]; then
      # shellcheck disable=SC1091
      . "${HOME}/.bashrc"
  fi

  if [ -f "${HOME}/.bash_login" ]; then
      # shellcheck disable=SC1091
      . "${HOME}/.bash_login"
  fi

#+END_SRC

#+BEGIN_SRC bash :tangle ../dotfiles/.zprofile
  # shellcheck source=".profile"
  if [ -f "${HOME}/.profile" ]; then
      # shellcheck disable=SC1091
      . "${HOME}/.profile"
  fi
#+END_SRC

#+begin_src bash :tangle ../dotfiles/.zshrc
  # The following lines were added by compinstall

  zstyle ':completion:*' completer _complete _ignored _approximate
  zstyle ':completion:*' list-colors ''
  zstyle ':completion:*' matcher-list ''
  zstyle ':completion:*' max-errors 2
  zstyle ':completion:*' menu select=3
  zstyle ':completion:*' select-prompt %SScrolling \
         active: current selection at %p%s
  zstyle :compinstall filename "${HOME}/.zshrc"

  # End of lines added by compinstall
  # Lines configured by zsh-newuser-install

#+end_src

* Init
** profile
#+BEGIN_SRC sh :tangle ../dotfiles/.profile
  LC_ALL=en_IN.UTF-8
  LANG=en_IN.UTF-8

  export LC_ALL
  export LANG
#+end_src
** bash
- Prevent bashrc from running outside non-interactive mode
  #+BEGIN_SRC bash :tangle ../dotfiles/.bashrc
    case $- in
        ,*i*)
        ;;
        ,*)
            return
            ;;
    esac
  #+END_SRC

  - Option settings
    #+BEGIN_SRC bash :tangle ../dotfiles/.bashrc
      shopt -s autocd
      shopt -s checkwinsize
      shopt -s extglob
      shopt -s globstar
      shopt -s histappend
      shopt -s histverify
    #+END_SRC

    - History
    #+BEGIN_SRC bash :tangle ../dotfiles/.bashrc
      shopt -s histappend
      HISTCONTROL=ignoreboth
      HISTFILE="${XDG_CACHE_HOME:-${HOME}/.cache}/.bash_history"
      HISTFILESIZE=10000
      HISTSIZE=10000
    #+END_SRC

    - Coloured terminals
    #+BEGIN_SRC bash :tangle ../dotfiles/.bashrc
      case "$TERM" in
          xterm-color|*-256color) color_prompt=yes;;
      esac
    #+END_SRC

    - Key-bindings
    #+BEGIN_SRC bash :tangle ../dotfiles/.bashrc
      set -o vi
      bind '"jk":vi-movement-mode'
    #+END_SRC
    
    - vterm directory and prompt tracking
      #+begin_src bash :tangle ../dotfiles/.bashrc
        vterm_prompt_end(){
            vterm_printf "51;A$(whoami)@$(hostname):$(pwd)"
        }
        PS1=$PS1'\[$(vterm_prompt_end)\]'
      #+end_src

