docs/index.html

<div id="outline-container-org0644b4b" class="outline-3">
<h3 id="org0644b4b">Bash</h3>
<div class="outline-text-3" id="text-org0644b4b">
</div>
<div id="outline-container-orgfbfc64e" class="outline-4">
<h4 id="orgfbfc64e">/etc/profile</h4>
<div class="outline-text-4" id="text-orgfbfc64e">
</div>
<ul class="org-ul">
<li><a id="orgd5f8109"></a>/etc/bashrc<br />
<ul class="org-ul">
<li><a id="orgef697d7"></a>/etc/profile.d/*<br /></li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-org072f450" class="outline-4">
<h4 id="org072f450">${HOME}/.bash_profile</h4>
<div class="outline-text-4" id="text-org072f450">
</div>
<ul class="org-ul">
<li><a id="orgc52457e"></a>${HOME}/.profile<br /></li>

<li><a id="org58866a8"></a>${HOME}/.bashrc<br />
<ul class="org-ul">
<li><a id="org8c03050"></a>${RUNCOMDIR}/env/shrc<br />
<ul class="org-ul">
<li><a id="orga43c925"></a>${XDG_CONFIG_HOME}/local.d/*<br /></li>
<li><a id="orgf770c77"></a>${XDG_CONFIG_HOME}/pvt.d/*<br /></li>
</ul>
</li>
</ul>
</li>

<li><a id="orgef3dcf5"></a>${HOME}/.bash_login<br />
<ul class="org-ul">
<li><a id="orgfd14ee8"></a>${RUNCOMDIR}/env/ui<br /></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgffdb411" class="outline-3">
<h3 id="orgffdb411">Zsh</h3>
<div class="outline-text-3" id="text-orgffdb411">
</div>
<div id="outline-container-orge12fd3d" class="outline-4">
<h4 id="orge12fd3d">/etc/profile</h4>
<div class="outline-text-4" id="text-orge12fd3d">
</div>
<ul class="org-ul">
<li><a id="org2f4348e"></a>/etc/zshrc<br />
<ul class="org-ul">
<li><a id="org8576755"></a>/etc/profile.d/*<br /></li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-orgff257eb" class="outline-4">
<h4 id="orgff257eb">${HOME}/.zshenv</h4>
</div>

<div id="outline-container-org4604a9c" class="outline-4">
<h4 id="org4604a9c">${HOME}/.zprofile</h4>
<div class="outline-text-4" id="text-org4604a9c">
</div>
<ul class="org-ul">
<li><a id="orga68a47a"></a>${HOME}/.profile<br /></li>
</ul>
</div>

<div id="outline-container-org11daf27" class="outline-4">
<h4 id="org11daf27">${HOME}/.zshrc</h4>
<div class="outline-text-4" id="text-org11daf27">
</div>
<ul class="org-ul">
<li><a id="orge5f82c1"></a>${RUNCOMDIR}/env/shrc<br />
<ul class="org-ul">
<li><a id="orgf5edc1b"></a>${XDG_CONFIG_HOME}/local.d/*<br /></li>
<li><a id="org4d78451"></a>${XDG_CONFIG_HOME}/pvt.d/*<br /></li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-orgf7134d2" class="outline-4">
<h4 id="orgf7134d2">${HOME}/.zlogin</h4>
<div class="outline-text-4" id="text-orgf7134d2">
</div>
<ul class="org-ul">
<li><a id="orgfe98465"></a>${RUNCOMDIR}/env/ui<br /></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgccb6503" class="outline-2">
<h2 id="orgccb6503">Headers</h2>
<div class="outline-text-2" id="text-orgccb6503">
<p>
Copyright, License banners
</p>
</div>
</div>
<div id="outline-container-orgfd94ff3" class="outline-2">
<h2 id="orgfd94ff3">Profiles</h2>
<div class="outline-text-2" id="text-orgfd94ff3">
<div class="org-src-container">
<pre class="src src-bash"><span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-1">[</span> -f <span class="org-string">"${HOME}/.profile"</span> <span class="org-rainbow-delimiters-depth-1">]</span>; <span class="org-keyword">then</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">shellcheck disable=SC1091</span>
    . <span class="org-string">"${HOME}/.profile"</span>
<span class="org-keyword">fi</span>

<span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-1">[</span> -f <span class="org-string">"${HOME}/.bashrc"</span> <span class="org-rainbow-delimiters-depth-1">]</span>; <span class="org-keyword">then</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">shellcheck disable=SC1091</span>
    . <span class="org-string">"${HOME}/.bashrc"</span>
<span class="org-keyword">fi</span>

<span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-1">[</span> -f <span class="org-string">"${HOME}/.bash_login"</span> <span class="org-rainbow-delimiters-depth-1">]</span>; <span class="org-keyword">then</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">shellcheck disable=SC1091</span>
    . <span class="org-string">"${HOME}/.bash_login"</span>
<span class="org-keyword">fi</span>

</pre>
</div>

<div class="org-src-container">
<pre class="src src-bash"><span class="org-comment-delimiter"># </span><span class="org-comment">shellcheck source=".profile"</span>
<span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-1">[</span> -f <span class="org-string">"${HOME}/.profile"</span> <span class="org-rainbow-delimiters-depth-1">]</span>; <span class="org-keyword">then</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">shellcheck disable=SC1091</span>
    . <span class="org-string">"${HOME}/.profile"</span>
<span class="org-keyword">fi</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-bash"><span class="org-comment-delimiter"># </span><span class="org-comment">The following lines were added by compinstall</span>

zstyle <span class="org-string">':completion:*'</span> completer _complete _ignored _approximate
zstyle <span class="org-string">':completion:*'</span> list-colors <span class="org-string">''</span>
zstyle <span class="org-string">':completion:*'</span> matcher-list <span class="org-string">''</span>
zstyle <span class="org-string">':completion:*'</span> max-errors 2
zstyle <span class="org-string">':completion:*'</span> menu <span class="org-variable-name">select</span>=3
zstyle <span class="org-string">':completion:*'</span> select-prompt %SScrolling <span class="org-sh-escaped-newline">\</span>
       active: current selection at %p%s
zstyle :compinstall filename <span class="org-string">"${HOME}/.zshrc"</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">End of lines added by compinstall</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Lines configured by zsh-newuser-install</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org0d086fc" class="outline-2">
<h2 id="org0d086fc">Init</h2>
<div class="outline-text-2" id="text-org0d086fc">
</div>
<div id="outline-container-org91bf4ad" class="outline-3">
<h3 id="org91bf4ad">profile</h3>
<div class="outline-text-3" id="text-org91bf4ad">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-variable-name">LC_ALL</span>=en_IN.UTF-8
<span class="org-variable-name">LANG</span>=en_IN.UTF-8

<span class="org-builtin">export</span> LC_ALL
<span class="org-builtin">export</span> LANG
</pre>
</div>
</div>
</div>
<div id="outline-container-org8b833fc" class="outline-3">
<h3 id="org8b833fc">bash</h3>
<div class="outline-text-3" id="text-org8b833fc">
<ul class="org-ul">
<li><p>
Prevent bashrc from running outside non-interactive mode
</p>
<div class="org-src-container">
<pre class="src src-bash"><span class="org-keyword">case</span> $<span class="org-variable-name">-</span><span class="org-keyword"> in</span>
    *i*)
    ;;
    *)
        <span class="org-keyword">return</span>
        ;;
<span class="org-keyword">esac</span>
</pre>
</div>

<ul class="org-ul">
<li><p>
Option settings
</p>
<div class="org-src-container">
<pre class="src src-bash">shopt -s autocd
shopt -s checkwinsize
shopt -s extglob
shopt -s globstar
shopt -s histappend
shopt -s histverify
</pre>
</div>

<ul class="org-ul">
<li>History</li>
</ul>
<div class="org-src-container">
<pre class="src src-bash">shopt -s histappend
<span class="org-variable-name">HISTCONTROL</span>=ignoreboth
<span class="org-variable-name">HISTFILE</span>=<span class="org-string">"${XDG_CACHE_HOME:-${HOME}/.cache}/.bash_history"</span>
<span class="org-variable-name">HISTFILESIZE</span>=10000
<span class="org-variable-name">HISTSIZE</span>=10000
</pre>
</div>

<ul class="org-ul">
<li>Coloured terminals</li>
</ul>
<div class="org-src-container">
<pre class="src src-bash"><span class="org-keyword">case</span> <span class="org-string">"$TERM"</span><span class="org-keyword"> in</span>
    xterm-color|*-256color) <span class="org-variable-name">color_prompt</span>=yes;;
<span class="org-keyword">esac</span>
</pre>
</div>

<ul class="org-ul">
<li>Key-bindings</li>
</ul>
<div class="org-src-container">
<pre class="src src-bash"><span class="org-builtin">set</span> -o vi
bind <span class="org-string">'"jk":vi-movement-mode'</span>
</pre>
</div>

<ul class="org-ul">
<li><p>
vterm directory and prompt tracking
</p>
<div class="org-src-container">
<pre class="src src-bash"><span class="org-function-name">vterm_prompt_end</span><span class="org-rainbow-delimiters-depth-1">(){</span>
    vterm_printf <span class="org-string">"51;A$(whoami)@$(hostname):$(pwd)"</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-variable-name">PS1</span>=$<span class="org-variable-name">PS1</span><span class="org-string">'\[$(vterm_prompt_end)\]'</span>
</pre>
</div></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
