docs/index.html

<div id="outline-container-org9b07b78" class="outline-3">
<h3 id="org9b07b78">zsh</h3>
<div class="outline-text-3" id="text-org9b07b78">
<p>
Settings
</p>
<ul class="org-ul">
<li><p>
History
</p>
<div class="org-src-container">
<pre class="src src-bash"><span class="org-variable-name">HISTFILE</span>=<span class="org-string">"${XDG_CACHE_HOME:-${HOME}/.cache}/.zhistory"</span>
<span class="org-variable-name">HISTSIZE</span>=10000
<span class="org-variable-name">SAVEHIST</span>=10000
</pre>
</div>
<ul class="org-ul">
<li><p>
cache files
</p>
<div class="org-src-container">
<pre class="src src-bash"><span class="org-variable-name">ZSH_COMPDUMP</span>=<span class="org-string">"${XDG_CACHE_HOME:-${HOME}/.cache}/.zcompdump"</span>
</pre>
</div></li>
</ul></li>
</ul>


<ul class="org-ul">
<li><p>
Options
</p>
<div class="org-src-container">
<pre class="src src-bash"><span class="org-variable-name">ZSH_AUTOSUGGEST_HIGHLIGHT_STYLE</span>=<span class="org-string">"fg=</span><span class="custom-2"><span class="custom-1">#5f6f7f</span></span><span class="org-string">,bg=</span><span class="custom"><span class="custom-1">#172737</span></span><span class="org-string">"</span>
<span class="org-variable-name">ZSH_AUTOSUGGEST_STRATEGY</span>=<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"history"</span> <span class="org-string">"completion"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-builtin">setopt</span> autocd
<span class="org-builtin">setopt</span> interactive_comments
<span class="org-builtin">setopt</span> appendhistory extendedglob notify
<span class="org-builtin">setopt</span> BANG_HIST                 <span class="org-comment-delimiter"># </span><span class="org-comment">Treat the '!' character specially during expansion.</span>
<span class="org-builtin">setopt</span> EXTENDED_HISTORY          <span class="org-comment-delimiter"># </span><span class="org-comment">Write the history file in the ":start:elapsed;command" format.</span>
<span class="org-builtin">setopt</span> INC_APPEND_HISTORY        <span class="org-comment-delimiter"># </span><span class="org-comment">Write to the history file immediately, not when the shell exits.</span>
<span class="org-builtin">setopt</span> HIST_EXPIRE_DUPS_FIRST    <span class="org-comment-delimiter"># </span><span class="org-comment">Expire duplicate entries first when trimming history.</span>
<span class="org-builtin">setopt</span> HIST_IGNORE_DUPS          <span class="org-comment-delimiter"># </span><span class="org-comment">Don't record an entry that was just recorded again.</span>
<span class="org-builtin">setopt</span> HIST_IGNORE_ALL_DUPS      <span class="org-comment-delimiter"># </span><span class="org-comment">Delete old recorded entry if new entry is a duplicate.</span>
<span class="org-builtin">setopt</span> HIST_FIND_NO_DUPS         <span class="org-comment-delimiter"># </span><span class="org-comment">Do not display a line previously found.</span>
<span class="org-builtin">setopt</span> HIST_SAVE_NO_DUPS         <span class="org-comment-delimiter"># </span><span class="org-comment">Don't write duplicate entries in the history file.</span>
<span class="org-builtin">setopt</span> HIST_IGNORE_SPACE         <span class="org-comment-delimiter"># </span><span class="org-comment">Don't record an entry starting with a space.</span>
<span class="org-builtin">setopt</span> HIST_REDUCE_BLANKS        <span class="org-comment-delimiter"># </span><span class="org-comment">Remove superfluous blanks before recording entry.</span>
<span class="org-builtin">setopt</span> HIST_VERIFY               <span class="org-comment-delimiter"># </span><span class="org-comment">Don't execute immediately upon history expansion.</span>
<span class="org-builtin">unsetopt</span> beep
<span class="org-builtin">autoload</span> colors &amp;&amp; colors
<span class="org-builtin">autoload</span> add-zsh-hook
<span class="org-builtin">autoload</span> -Uz compinit
<span class="org-builtin">autoload</span> -Uz bashcompinit
compinit
bashcompinit
</pre>
</div></li>

<li><p>
Key-bindings
</p>
<div class="org-src-container">
<pre class="src src-bash"><span class="org-variable-name">term_key_source</span>=<span class="org-string">"${HOME}/.zkbd/$TERM-${${DISPLAY:t}:-$VENDOR-$OSTYPE}"</span>
<span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-1">[</span> -f <span class="org-string">"${term_key_source}"</span> <span class="org-rainbow-delimiters-depth-1">]</span>; <span class="org-keyword">then</span>
    . <span class="org-string">"${term_key_source}"</span>
<span class="org-keyword">fi</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">keybindings</span>
<span class="org-builtin">bindkey</span> -v
<span class="org-builtin">bindkey</span> -s <span class="org-string">'^o'</span> <span class="org-string">'lfcd\n'</span>
<span class="org-builtin">bindkey</span> -s <span class="org-string">'^f'</span> <span class="org-string">'fzfcd\n'</span>
<span class="org-builtin">bindkey</span> -s <span class="org-string">'^E'</span> <span class="org-string">'deactivate 2&gt;/dev/null || true\n'</span>
<span class="org-builtin">bindkey</span> -s <span class="org-string">'^N'</span> <span class="org-string">'force_global_venv\n'</span>
<span class="org-builtin">bindkey</span> <span class="org-string">'^[[P'</span> delete-char  <span class="org-comment-delimiter"># </span><span class="org-comment">backspace key</span>
<span class="org-builtin">bindkey</span> <span class="org-string">'^[[1;5D'</span> vi-backward-word  <span class="org-comment-delimiter"># </span><span class="org-comment">ctrl &lt;-</span>
<span class="org-builtin">bindkey</span> <span class="org-string">'^[[1;5C'</span> vi-forward-word  <span class="org-comment-delimiter"># </span><span class="org-comment">ctrl -&gt;</span>
<span class="org-builtin">bindkey</span> <span class="org-string">'^[[3~'</span> vi-delete-char  <span class="org-comment-delimiter"># </span><span class="org-comment">delete key</span>
<span class="org-builtin">bindkey</span> <span class="org-string">'^[[F'</span> vi-end-of-line  <span class="org-comment-delimiter"># </span><span class="org-comment">end key</span>
<span class="org-builtin">bindkey</span> <span class="org-string">'^[[H'</span> vi-beginning-of-line  <span class="org-comment-delimiter"># </span><span class="org-comment">home key</span>
<span class="org-builtin">bindkey</span> <span class="org-string">"^[[27;2;13~"</span> vi-open-line-below  <span class="org-comment-delimiter"># </span><span class="org-comment">shift Return</span>
<span class="org-builtin">export</span> <span class="org-variable-name">KEYTIMEOUT</span>=10

<span class="org-comment-delimiter"># </span><span class="org-comment">Use beam shape cursor for each new prompt.</span>
<span class="org-function-name">_rc_fix_cursor</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-builtin">echo</span> -ne <span class="org-string">'\e[6 q'</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
add-zsh-hook precmd _rc_fix_cursor

<span class="org-comment-delimiter"># </span><span class="org-comment">Change cursor shape for different vi modes.</span>
<span class="org-function-name">zle-keymap-select</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-string">"${KEYMAP}"</span> = <span class="org-string">"vicmd"</span> <span class="org-rainbow-delimiters-depth-2">]</span> ||
           <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-string">"${1}"</span> = <span class="org-string">'block'</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        printf <span class="org-string">'\e[2 q'</span>

    <span class="org-keyword">elif</span> <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-string">"${KEYMAP}"</span> = <span class="org-string">"main"</span> <span class="org-rainbow-delimiters-depth-2">]</span> ||
             <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-string">"${KEYMAP}"</span> = <span class="org-string">"viins"</span> <span class="org-rainbow-delimiters-depth-2">]</span> ||
             <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-string">"${KEYMAP}"</span> = <span class="org-string">''</span> <span class="org-rainbow-delimiters-depth-2">]</span> ||
             <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-string">"${1}"</span> = <span class="org-string">'beam'</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        printf <span class="org-string">'\e[6 q'</span>
    <span class="org-keyword">elif</span> <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-string">"${KEYMAP}"</span> = <span class="org-string">"visual"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        printf <span class="org-string">'\e[4 q'</span>
    <span class="org-keyword">fi</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Use vim keys in tab complete menu:</span>
zmodload zsh/complist
zmodload zsh/mapfile
<span class="org-builtin">bindkey</span> -M menuselect <span class="org-string">'h'</span> vi-backward-char
<span class="org-builtin">bindkey</span> -M menuselect <span class="org-string">'k'</span> vi-up-line-or-history
<span class="org-builtin">bindkey</span> -M menuselect <span class="org-string">'l'</span> vi-forward-char
<span class="org-builtin">bindkey</span> -M menuselect <span class="org-string">'j'</span> vi-down-line-or-history
<span class="org-builtin">bindkey</span> -v <span class="org-string">'^?'</span> backward-delete-char
<span class="org-builtin">bindkey</span> -M viins <span class="org-string">'jk'</span> vi-cmd-mode
<span class="org-builtin">bindkey</span> <span class="org-string">'^r'</span> history-incremental-search-backward

zle -N zle-keymap-select

</pre>
</div></li>
<li>Unset options:
<ul class="org-ul">
<li>setopt SHARE_HISTORY             # Share history between all sessions.</li>
<li>setopt HIST_BEEP                 # Beep when accessing non-existent history.</li>
</ul></li>

<li><p>
vterm directory and prompt tracking
</p>
<div class="org-src-container">
<pre class="src src-bash"><span class="org-function-name">vterm_prompt_end</span><span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    vterm_printf <span class="org-string">"51;A$(whoami)@$(hostname):$(pwd)"</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-builtin">setopt</span> PROMPT_SUBST
<span class="org-variable-name">PROMPT</span>=$<span class="org-variable-name">PROMPT</span><span class="org-string">'%{$(vterm_prompt_end)%}'</span>
</pre>
</div></li>
</ul>
</div>
</div>
</div>
