org/index.org
** bash
#+BEGIN_SRC bash :tangle ../dotfiles/.bashrc
  # shellcheck source=".runcom/env/shrc"
  if [ -f "${RUNCOMDIR:-${HOME}/.runcom}/env/shrc" ]; then
      . "${RUNCOMDIR:-${HOME}/.runcom}/env/shrc"
  fi
  if [ -f "${RUNCOMDIR:-${HOME}/.runcom}/bash-preexec/bash-preexec.sh" ]; then
      . "${RUNCOMDIR:-${HOME}/.runcom}/bash-preexec/bash-preexec.sh"
  fi
#+END_SRC

** zsh
#+BEGIN_SRC bash :tangle ../dotfiles/.zshrc
  # shellcheck source=".runcom/env/shrc"
  if [ -f "${RUNCOMDIR:-${HOME}/.runcom}/env/shrc" ]; then
      . "${RUNCOMDIR:-${HOME}/.runcom}/env/shrc"
  fi
  while read -r addition; do
      while read -r share_dir; do
          add_dir="${share_dir}/zsh-${addition}"
          if [ -d "${add_dir}" ]; then
              # shellcheck disable=SC1090
              . "${add_dir}/zsh-${addition}.zsh"
              break
          fi
      done << data_dir
  /usr/local/share
  /usr/share
  /usr/share/zsh/plugins
  ${XDG_DATA_HOME:-${HOME}/.local/share}
  ${XDG_DATA_HOME:-${HOME}/.local/share}/pspman/local/share
  ${HOME}/local/share
  ${HOME}/share
  data_dir
  done << addlist
  syntax-highlighting
  autosuggestions
  addlist

  unset addition share_dir add_dir

#+END_SRC

** shrc
*** Current shelL
Which shell is running?
#+BEGIN_SRC sh :tangle ../env/shrc
  _RC_SHELL="$(readlink /proc/$$/exe | sed "s/.*\///")"
  export _RC_SHELL
#+END_SRC

*** Local un-synced changes
All files =${XDG_CONFIG_HOME:-${HOME}/.config}/{local,pvt}.d/.*rc=
#+BEGIN_SRC sh :tangle ../env/shrc
  # shellcheck disable=SC1090
  for unsync_d in "local.d" "pvt.d"; do
      for rcfile in "${XDG_CONFIG_HOME:-${HOME}/.config}/${unsync_d}"/.*rc; do
          . "${rcfile}"
      done 2>/dev/null
  done 2>/dev/null

  unset rcfile unsync_d
#+END_SRC

* Better alternatives
** Alias-er script
Alias some common commands to better alternatives if available.
Commands that are listed (<space> separated) in the environment variable
~_RC_NO_ALT~ are not aliased.
#+BEGIN_SRC sh :tangle ../env/shrc
  # use better alternatives
  # Args:
  #     canon_cmd: canonically used command
  #     alt_cmds: optional list of alternative that may be used if available
  # Environment Variables
  #     _RC_NO_ALT: Don't replace alternatives for <space> separated
  _rc_alternative () {
      if [ ! "${_RC_NO_ALT% "${1}"*}" = "${_RC_NO_ALT}" ] ||\
         [ ! "${_RC_NO_ALT#*"${1}" }" = "${_RC_NO_ALT}" ] ||\
         [ "${1}" = "${_RC_NO_ALT}" ]; then
          return
      fi
      _rc_old_cmd="${1}"
      shift
      for _rc_alt in "$@"; do
          if builtin command -v "${_rc_alt%% *}" >/dev/null 2>&1; then
              eval "alias ${_rc_old_cmd}=\"${_rc_alt}\"";
              return
          fi
      done
      unset _rc_alt _rc_old_cmd
  }
#+END_SRC
** alias commands
#+BEGIN_SRC sh :tangle ../env/shrc
  _rc_alternative cat bat
  _rc_alternative diff delta difft
  _rc_alternative df lfs
  _rc_alternative du "dust" "du -hc"
  _rc_alternative grep "rg --color=auto" "ag" "pt" "ack"
  _rc_alternative ls "exa -Fh --color=auto"
  _rc_alternative vim nvim
  _rc_alternative ex nvim
  _rc_alternative docker podman
  _rc_alternative docker-compose "podman compose"
#+END_SRC

** Atuin
Use [[https://github.com/ellie/atuin][atuin]] for up-arrow history if available
#+BEGIN_SRC sh :tangle ../env/shrc
  if builtin command -v 'atuin' >/dev/null 2>&1; then
      eval "$(atuin init "${_RC_SHELL}" 2>/dev/null)"
  fi
#+END_SRC

** List Contents
#+BEGIN_SRC sh :tangle ../env/shrc
  alias la='ls -a';
  alias ll='ls -lr -s size';
  alias lla='ls -la';
  alias l.='ls -a |grep "^\."';
  alias sl="ls";
#+END_SRC

* Variables
