docs/index.html

<div id="outline-container-org5a76810" class="outline-2">
<h2 id="org5a76810">Inherit</h2>
<div class="outline-text-2" id="text-org5a76810">
</div>
<div id="outline-container-org6aaa260" class="outline-3">
<h3 id="org6aaa260">bash</h3>
<div class="outline-text-3" id="text-org6aaa260">
<div class="org-src-container">
<pre class="src src-bash"><span class="org-comment-delimiter"># </span><span class="org-comment">shellcheck source=".runcom/env/shrc"</span>
<span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-1">[</span> -f <span class="org-string">"${RUNCOMDIR:-${HOME}/.runcom}/env/shrc"</span> <span class="org-rainbow-delimiters-depth-1">]</span>; <span class="org-keyword">then</span>
    . <span class="org-string">"${RUNCOMDIR:-${HOME}/.runcom}/env/shrc"</span>
<span class="org-keyword">fi</span>
<span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-1">[</span> -f <span class="org-string">"${RUNCOMDIR:-${HOME}/.runcom}/bash-preexec/bash-preexec.sh"</span> <span class="org-rainbow-delimiters-depth-1">]</span>; <span class="org-keyword">then</span>
    . <span class="org-string">"${RUNCOMDIR:-${HOME}/.runcom}/bash-preexec/bash-preexec.sh"</span>
<span class="org-keyword">fi</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcc7d06a" class="outline-3">
<h3 id="orgcc7d06a">zsh</h3>
<div class="outline-text-3" id="text-orgcc7d06a">
<div class="org-src-container">
<pre class="src src-bash"><span class="org-comment-delimiter"># </span><span class="org-comment">shellcheck source=".runcom/env/shrc"</span>
<span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-1">[</span> -f <span class="org-string">"${RUNCOMDIR:-${HOME}/.runcom}/env/shrc"</span> <span class="org-rainbow-delimiters-depth-1">]</span>; <span class="org-keyword">then</span>
    . <span class="org-string">"${RUNCOMDIR:-${HOME}/.runcom}/env/shrc"</span>
<span class="org-keyword">fi</span>
<span class="org-keyword">while </span><span class="org-builtin">read</span> -r addition; <span class="org-keyword">do</span>
    <span class="org-keyword">while </span><span class="org-builtin">read</span> -r share_dir; <span class="org-keyword">do</span>
        <span class="org-variable-name">add_dir</span>=<span class="org-string">"${share_dir}/zsh-${addition}"</span>
        <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-1">[</span> -d <span class="org-string">"${add_dir}"</span> <span class="org-rainbow-delimiters-depth-1">]</span>; <span class="org-keyword">then</span>
            <span class="org-comment-delimiter"># </span><span class="org-comment">shellcheck disable=SC1090</span>
            . <span class="org-string">"${add_dir}/zsh-${addition}.zsh"</span>
            <span class="org-keyword">break</span>
        <span class="org-keyword">fi</span>
    <span class="org-keyword">done</span> &lt;&lt; data_dir
<span class="org-sh-heredoc">/usr/local/share</span>
<span class="org-sh-heredoc">/usr/share</span>
<span class="org-sh-heredoc">/usr/share/zsh/plugins</span>
<span class="org-sh-heredoc">${XDG_DATA_HOME:-${HOME}/.local/share}</span>
<span class="org-sh-heredoc">${XDG_DATA_HOME:-${HOME}/.local/share}/pspman/local/share</span>
<span class="org-sh-heredoc">${HOME}/local/share</span>
<span class="org-sh-heredoc">${HOME}/share</span>
<span class="org-sh-heredoc">data_dir</span>
<span class="org-keyword">done</span> &lt;&lt; addlist
<span class="org-sh-heredoc">syntax-highlighting</span>
<span class="org-sh-heredoc">autosuggestions</span>
<span class="org-sh-heredoc">addlist</span>

<span class="org-builtin">unset</span> addition share_dir add_dir

</pre>
</div>
</div>
</div>

<div id="outline-container-org4e9f0e5" class="outline-3">
<h3 id="org4e9f0e5">shrc</h3>
<div class="outline-text-3" id="text-org4e9f0e5">
</div>
<div id="outline-container-orgcae94d6" class="outline-4">
<h4 id="orgcae94d6">Current shelL</h4>
<div class="outline-text-4" id="text-orgcae94d6">
<p>
Which shell is running?
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="org-variable-name">_RC_SHELL</span>=<span class="org-string">"$(readlink /proc/$$/exe | sed "s/.*\///")"</span>
<span class="org-builtin">export</span> _RC_SHELL
</pre>
</div>
</div>
</div>

<div id="outline-container-orga2f4bf8" class="outline-4">
<h4 id="orga2f4bf8">Local un-synced changes</h4>
<div class="outline-text-4" id="text-orga2f4bf8">
<p>
All files <code>${XDG_CONFIG_HOME:-${HOME}/.config}/{local,pvt}.d/.*rc</code>
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">shellcheck disable=SC1090</span>
<span class="org-keyword">for</span> unsync_d<span class="org-keyword"> in</span> <span class="org-string">"local.d"</span> <span class="org-string">"pvt.d"</span>; <span class="org-keyword">do</span>
    <span class="org-keyword">for</span> rcfile<span class="org-keyword"> in</span> <span class="org-string">"${XDG_CONFIG_HOME:-${HOME}/.config}/${unsync_d}"</span>/.*rc; <span class="org-keyword">do</span>
        . <span class="org-string">"${rcfile}"</span>
    <span class="org-keyword">done</span> 2&gt;/dev/null
<span class="org-keyword">done</span> 2&gt;/dev/null

<span class="org-builtin">unset</span> rcfile unsync_d
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd003abe" class="outline-2">
<h2 id="orgd003abe">Better alternatives</h2>
<div class="outline-text-2" id="text-orgd003abe">
</div>
<div id="outline-container-orgfc89766" class="outline-3">
<h3 id="orgfc89766">Alias-er script</h3>
<div class="outline-text-3" id="text-orgfc89766">
<p>
Alias some common commands to better alternatives if available.
Commands that are listed (&lt;space&gt; separated) in the environment variable
<code>_RC_NO_ALT</code> are not aliased.
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">use better alternatives</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Args:</span>
<span class="org-comment-delimiter">#     </span><span class="org-comment">canon_cmd: canonically used command</span>
<span class="org-comment-delimiter">#     </span><span class="org-comment">alt_cmds: optional list of alternative that may be used if available</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Environment Variables</span>
<span class="org-comment-delimiter">#     </span><span class="org-comment">_RC_NO_ALT: Don't replace alternatives for &lt;space&gt; separated</span>
<span class="org-function-name">_rc_alternative</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-negation-char">!</span> <span class="org-string">"${_RC_NO_ALT% "</span>$<span class="org-rainbow-delimiters-depth-3">{</span><span class="org-variable-name">1</span><span class="org-rainbow-delimiters-depth-3">}</span><span class="org-string">"*}"</span> = <span class="org-string">"${_RC_NO_ALT}"</span> <span class="org-rainbow-delimiters-depth-2">]</span> ||<span class="org-sh-escaped-newline">\</span>
       <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-negation-char">!</span> <span class="org-string">"${_RC_NO_ALT#*"</span>$<span class="org-rainbow-delimiters-depth-3">{</span><span class="org-variable-name">1</span><span class="org-rainbow-delimiters-depth-3">}</span><span class="org-string">" }"</span> = <span class="org-string">"${_RC_NO_ALT}"</span> <span class="org-rainbow-delimiters-depth-2">]</span> ||<span class="org-sh-escaped-newline">\</span>
       <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-string">"${1}"</span> = <span class="org-string">"${_RC_NO_ALT}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-keyword">return</span>
    <span class="org-keyword">fi</span>
    <span class="org-variable-name">_rc_old_cmd</span>=<span class="org-string">"${1}"</span>
    <span class="org-builtin">shift</span>
    <span class="org-keyword">for</span> _rc_alt<span class="org-keyword"> in</span> <span class="org-string">"$@"</span>; <span class="org-keyword">do</span>
        <span class="org-keyword">if </span><span class="org-builtin">builtin</span> command -v <span class="org-string">"${_rc_alt%% *}"</span> &gt;/dev/null 2&gt;&amp;1; <span class="org-keyword">then</span>
            <span class="org-builtin">eval</span> <span class="org-string">"alias ${_rc_old_cmd}=\"${_rc_alt}\""</span>;
            <span class="org-keyword">return</span>
        <span class="org-keyword">fi</span>
    <span class="org-keyword">done</span>
    <span class="org-builtin">unset</span> _rc_alt _rc_old_cmd
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org9d285a7" class="outline-3">
<h3 id="org9d285a7">alias commands</h3>
<div class="outline-text-3" id="text-org9d285a7">
<div class="org-src-container">
<pre class="src src-sh">_rc_alternative cat bat
_rc_alternative diff delta difft
_rc_alternative df lfs
_rc_alternative du <span class="org-string">"dust"</span> <span class="org-string">"du -hc"</span>
_rc_alternative grep <span class="org-string">"rg --color=auto"</span> <span class="org-string">"ag"</span> <span class="org-string">"pt"</span> <span class="org-string">"ack"</span>
_rc_alternative ls <span class="org-string">"exa -Fh --color=auto"</span>
_rc_alternative vim nvim
_rc_alternative ex nvim
_rc_alternative docker podman
_rc_alternative docker-compose <span class="org-string">"podman compose"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd18599b" class="outline-3">
<h3 id="orgd18599b">Atuin</h3>
<div class="outline-text-3" id="text-orgd18599b">
<p>
Use <a href="https://github.com/ellie/atuin">atuin</a> for up-arrow history if available
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="org-keyword">if </span><span class="org-builtin">builtin</span> command -v <span class="org-string">'atuin'</span> &gt;/dev/null 2&gt;&amp;1; <span class="org-keyword">then</span>
    <span class="org-builtin">eval</span> <span class="org-string">"$(atuin init "${_RC_SHELL}" 2&gt;/dev/null)"</span>
<span class="org-keyword">fi</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org29496ae" class="outline-3">
<h3 id="org29496ae">List Contents</h3>
<div class="outline-text-3" id="text-org29496ae">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-builtin">alias</span> <span class="org-variable-name">la</span>=<span class="org-string">'ls -a'</span>;
<span class="org-builtin">alias</span> <span class="org-variable-name">ll</span>=<span class="org-string">'ls -lr -s size'</span>;
<span class="org-builtin">alias</span> <span class="org-variable-name">lla</span>=<span class="org-string">'ls -la'</span>;
<span class="org-builtin">alias</span> l.=<span class="org-string">'ls -a |grep "^\."'</span>;
<span class="org-builtin">alias</span> <span class="org-variable-name">sl</span>=<span class="org-string">"ls"</span>;
</pre>
</div>
</div>
</div>
</div>
