org/index.org
** XDG
XDG standard locations specifications these can be redefined in
=${XDG_CONFIG_HOME:-${HOME}/.config}/pvt.d/.<some name>rc=

#+BEGIN_SRC sh :tangle ../dotfiles/.profile
  XDG_CACHE_HOME="${HOME}/.cache"
  XDG_CONFIG_HOME="${HOME}/.config"
  XDG_DATA_HOME="${HOME}/.local/share"
  XDG_STATE_HOME="${HOME}/.local/state"
  RUNCOMDIR="${HOME}/.runcom"

  export XDG_CACHE_HOME
  export XDG_CONFIG_HOME
  export XDG_DATA_HOME
  export XDG_STATE_HOME
  export RUNCOMDIR
#+END_SRC

** PATH
#+BEGIN_SRC sh :tangle ../dotfiles/.profile
  # shellcheck source="bin"
  if [ -d "${HOME}/bin" ] ; then
      if [ "${PATH#*${HOME}/bin}" = "${PATH}" ]; then
          PATH="${HOME}/bin:${PATH}"
      fi
  fi

  # shellcheck source=".local/bin"
  if [ -d "${HOME}/.local/bin" ] ; then
      if [ "${PATH#*${HOME}/.local/bin}" = "${PATH}" ]; then
          PATH="${HOME}/.local/bin:${PATH}"
      fi
  fi
  export PATH;
#+END_SRC

** Editor wars
#+BEGIN_SRC sh :tangle ../dotfiles/.profile
  while read -r avail; do
      if builtin command -v "${avail}" >/dev/null 2>&1; then
          EDITOR="${avail}"
      fi
  done << EOF
  nano
  vi
  vim
  nvim
  EOF
  export EDITOR

  case "$EDITOR" in
      vim)
          export MANPAGER='/bin/bash -c "vim -MRn -c \"set buftype=nofile showtabline=0 ft=man ts=8 nomod nolist norelativenumber nonu noma\" -c \"normal L\" -c \"nmap q :qa<CR>\"</dev/tty <(col -b)"'
          ;;
      nvim)
          export MANPAGER="nvim -c ':Man!' -"
          ;;
      ,*)
          if builtin command -v bat; then
              export MANPAGER='bat -l man -p'
          fi
          ;;
  esac
  export MANPAGER
#+END_SRC

** C(++) exports
#+BEGIN_SRC sh :tangle ../dotfiles/.profile
  LD_LIBRARY_PATH="${HOME}/.local/lib:${HOME}/.local/lib64";
  C_INCLUDE_PATH="${XDG_DATA_HOME}/pspman/include/"
  CPLUS_INCLUDE_PATH="${XDG_DATA_HOME}/pspman/include/"
  export LD_LIBRARY_PATH
  export C_INCLUDE_PATH
  export CPLUS_INCLUDE_PATH
#+END_SRC

** CARGO (Rust) exports
Cargo unnecessarily clutters =${HOME}= with its DATA.
It should be in =XDG_DATA_HOME=
Also, cargo's binaries should be installed in
=${XDG_DATA_HOME}/../bin= like python3.
#+BEGIN_SRC sh :tangle ../dotfiles/.profile
  CARGO_HOME="${HOME}/.local/share/cargo"
  export CARGO_HOME
#+END_SRC

** GPU exports
#+BEGIN_SRC sh :tangle ../dotfiles/.profile
  PYOPENCL_CTX='0';
  PYOPENCL_COMPILER_OUTPUT=1;
  OCL_ICD_VENDORS="/etc/OpenCL/vendors/";
  export PYOPENCL_CTX
  export PYOPENCL_COMPILER_OUTPUT
  export OCL_ICD_VENDORS
#+END_SRC

** Bemenu exports
#+BEGIN_SRC sh :tangle ../env/shrc
  export BEMENU_OPTS='--fn firacode 14 '
#+END_SRC

** GTK+ debugging output
Silence debugging output for gtk+
#+BEGIN_SRC sh :tangle ../dotfiles/.profile
  NO_AT_BRIDGE=1
  export NO_AT_BRIDGE
#+END_SRC

* Functions
** Python
*** Python version
to locate site-packages

#+BEGIN_SRC sh :tangle ../env/shrc
  # default python version major.minor
  python_ver() {
      python --version |cut -d "." -f1,2 |sed 's/ //' |sed 's/P/p/'
  }
#+END_SRC

