docs/index.html

<div id="outline-container-org77dc0c1" class="outline-2">
<h2 id="org77dc0c1">Variables</h2>
<div class="outline-text-2" id="text-org77dc0c1">
</div>
<div id="outline-container-org9e1b647" class="outline-3">
<h3 id="org9e1b647">XDG</h3>
<div class="outline-text-3" id="text-org9e1b647">
<p>
XDG standard locations specifications these can be redefined in
<code>${XDG_CONFIG_HOME:-${HOME}/.config}/pvt.d/.&lt;some name&gt;rc</code>
</p>

<div class="org-src-container">
<pre class="src src-sh"><span class="org-variable-name">XDG_CACHE_HOME</span>=<span class="org-string">"${HOME}/.cache"</span>
<span class="org-variable-name">XDG_CONFIG_HOME</span>=<span class="org-string">"${HOME}/.config"</span>
<span class="org-variable-name">XDG_DATA_HOME</span>=<span class="org-string">"${HOME}/.local/share"</span>
<span class="org-variable-name">XDG_STATE_HOME</span>=<span class="org-string">"${HOME}/.local/state"</span>
<span class="org-variable-name">RUNCOMDIR</span>=<span class="org-string">"${HOME}/.runcom"</span>

<span class="org-builtin">export</span> XDG_CACHE_HOME
<span class="org-builtin">export</span> XDG_CONFIG_HOME
<span class="org-builtin">export</span> XDG_DATA_HOME
<span class="org-builtin">export</span> XDG_STATE_HOME
<span class="org-builtin">export</span> RUNCOMDIR
</pre>
</div>
</div>
</div>

<div id="outline-container-org2092bfe" class="outline-3">
<h3 id="org2092bfe">PATH</h3>
<div class="outline-text-3" id="text-org2092bfe">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">shellcheck source="bin"</span>
<span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-1">[</span> -d <span class="org-string">"${HOME}/bin"</span> <span class="org-rainbow-delimiters-depth-1">]</span> ; <span class="org-keyword">then</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-1">[</span> <span class="org-string">"${PATH#*${HOME}/bin}"</span> = <span class="org-string">"${PATH}"</span> <span class="org-rainbow-delimiters-depth-1">]</span>; <span class="org-keyword">then</span>
        <span class="org-variable-name">PATH</span>=<span class="org-string">"${HOME}/bin:${PATH}"</span>
    <span class="org-keyword">fi</span>
<span class="org-keyword">fi</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">shellcheck source=".local/bin"</span>
<span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-1">[</span> -d <span class="org-string">"${HOME}/.local/bin"</span> <span class="org-rainbow-delimiters-depth-1">]</span> ; <span class="org-keyword">then</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-1">[</span> <span class="org-string">"${PATH#*${HOME}/.local/bin}"</span> = <span class="org-string">"${PATH}"</span> <span class="org-rainbow-delimiters-depth-1">]</span>; <span class="org-keyword">then</span>
        <span class="org-variable-name">PATH</span>=<span class="org-string">"${HOME}/.local/bin:${PATH}"</span>
    <span class="org-keyword">fi</span>
<span class="org-keyword">fi</span>
<span class="org-builtin">export</span> PATH;
</pre>
</div>
</div>
</div>

<div id="outline-container-org55a741f" class="outline-3">
<h3 id="org55a741f">Editor wars</h3>
<div class="outline-text-3" id="text-org55a741f">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-keyword">while </span><span class="org-builtin">read</span> -r avail; <span class="org-keyword">do</span>
    <span class="org-keyword">if </span><span class="org-builtin">builtin</span> command -v <span class="org-string">"${avail}"</span> &gt;/dev/null 2&gt;&amp;1; <span class="org-keyword">then</span>
        <span class="org-variable-name">EDITOR</span>=<span class="org-string">"${avail}"</span>
    <span class="org-keyword">fi</span>
<span class="org-keyword">done</span> &lt;&lt; EOF
<span class="org-sh-heredoc">nano</span>
<span class="org-sh-heredoc">vi</span>
<span class="org-sh-heredoc">vim</span>
<span class="org-sh-heredoc">nvim</span>
<span class="org-sh-heredoc">EOF</span>
<span class="org-builtin">export</span> EDITOR

<span class="org-keyword">case</span> <span class="org-string">"$EDITOR"</span><span class="org-keyword"> in</span>
    vim)
        <span class="org-builtin">export</span> <span class="org-variable-name">MANPAGER</span>=<span class="org-string">'/bin/bash -c "vim -MRn -c \"set buftype=nofile showtabline=0 ft=man ts=8 nomod nolist norelativenumber nonu noma\" -c \"normal L\" -c \"nmap q :qa&lt;CR&gt;\"&lt;/dev/tty &lt;(col -b)"'</span>
        ;;
    nvim)
        <span class="org-builtin">export</span> <span class="org-variable-name">MANPAGER</span>=<span class="org-string">"nvim -c ':Man!' -"</span>
        ;;
    *)
        <span class="org-keyword">if </span><span class="org-builtin">builtin</span> command -v bat; <span class="org-keyword">then</span>
            <span class="org-builtin">export</span> <span class="org-variable-name">MANPAGER</span>=<span class="org-string">'bat -l man -p'</span>
        <span class="org-keyword">fi</span>
        ;;
<span class="org-keyword">esac</span>
<span class="org-builtin">export</span> MANPAGER
</pre>
</div>
</div>
</div>

<div id="outline-container-orge5611e1" class="outline-3">
<h3 id="orge5611e1">C(++) exports</h3>
<div class="outline-text-3" id="text-orge5611e1">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-variable-name">LD_LIBRARY_PATH</span>=<span class="org-string">"${HOME}/.local/lib:${HOME}/.local/lib64"</span>;
<span class="org-variable-name">C_INCLUDE_PATH</span>=<span class="org-string">"${XDG_DATA_HOME}/pspman/include/"</span>
<span class="org-variable-name">CPLUS_INCLUDE_PATH</span>=<span class="org-string">"${XDG_DATA_HOME}/pspman/include/"</span>
<span class="org-builtin">export</span> LD_LIBRARY_PATH
<span class="org-builtin">export</span> C_INCLUDE_PATH
<span class="org-builtin">export</span> CPLUS_INCLUDE_PATH
</pre>
</div>
</div>
</div>

<div id="outline-container-orgae2b4d4" class="outline-3">
<h3 id="orgae2b4d4">CARGO (Rust) exports</h3>
<div class="outline-text-3" id="text-orgae2b4d4">
<p>
Cargo unnecessarily clutters <code>${HOME}</code> with its DATA.
It should be in <code>XDG_DATA_HOME</code>
Also, cargo&rsquo;s binaries should be installed in
<code>${XDG_DATA_HOME}/../bin</code> like python3.
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="org-variable-name">CARGO_HOME</span>=<span class="org-string">"${HOME}/.local/share/cargo"</span>
<span class="org-builtin">export</span> CARGO_HOME
</pre>
</div>
</div>
</div>

<div id="outline-container-org49eca7e" class="outline-3">
<h3 id="org49eca7e">GPU exports</h3>
<div class="outline-text-3" id="text-org49eca7e">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-variable-name">PYOPENCL_CTX</span>=<span class="org-string">'0'</span>;
<span class="org-variable-name">PYOPENCL_COMPILER_OUTPUT</span>=1;
<span class="org-variable-name">OCL_ICD_VENDORS</span>=<span class="org-string">"/etc/OpenCL/vendors/"</span>;
<span class="org-builtin">export</span> PYOPENCL_CTX
<span class="org-builtin">export</span> PYOPENCL_COMPILER_OUTPUT
<span class="org-builtin">export</span> OCL_ICD_VENDORS
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd6a797a" class="outline-3">
<h3 id="orgd6a797a">Bemenu exports</h3>
<div class="outline-text-3" id="text-orgd6a797a">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-builtin">export</span> <span class="org-variable-name">BEMENU_OPTS</span>=<span class="org-string">'--fn firacode 14 '</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc5e4d21" class="outline-3">
<h3 id="orgc5e4d21">GTK+ debugging output</h3>
<div class="outline-text-3" id="text-orgc5e4d21">
<p>
Silence debugging output for gtk+
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="org-variable-name">NO_AT_BRIDGE</span>=1
<span class="org-builtin">export</span> NO_AT_BRIDGE
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org84f45e7" class="outline-2">
<h2 id="org84f45e7">Functions</h2>
<div class="outline-text-2" id="text-org84f45e7">
</div>
<div id="outline-container-org9aee8a7" class="outline-3">
<h3 id="org9aee8a7">Python</h3>
<div class="outline-text-3" id="text-org9aee8a7">
</div>
<div id="outline-container-orgd9d3daa" class="outline-4">
<h4 id="orgd9d3daa">Python version</h4>
<div class="outline-text-4" id="text-orgd9d3daa">
<p>
to locate site-packages
</p>

<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">default python version major.minor</span>
<span class="org-function-name">python_ver</span><span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    python --version |cut -d <span class="org-string">"."</span> -f1,2 |sed <span class="org-string">'s/ //'</span> |sed <span class="org-string">'s/P/p/'</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>
