org/index.org
*** Quickly change to virtualenv
Scan up to mount-point, if any direct parent has .venv, source that ".venv/bin/activate"
This may require shell-identification for ksh, csh, fish since they have a different activate
#+BEGIN_SRC sh :tangle ../env/shrc
  # Walk upto mount-point (if within 16 levels) and look for
  # '.venv' directory that contains python
  # virtual environment. If found, switch to it
  to_venv () {
      test_d="$(readlink -f "${PWD}")"
      parents=16  # path too long to waste time
      until mountpoint "${test_d}" > /dev/null 2> /dev/null; do
          if [ $parents -le 0 ]; then
              printf "Too many branch-nodes searched" >&2
              unset parents test_d env_d
              return 126
          fi
          for env_d in ".venv" "venv"; do
              if [ -d "${test_d}/${env_d}" ] \
                     || [ -L "${test_d}/${env_d}" ]; then
                  # shellcheck disable=SC1090
                  . "${test_d}/${env_d}/bin/activate"
                  printf "Found %s, switching...\n" "${test_d}/${env_d}"
                  unset parents test_d env_d
                  return 0
              fi
          done
          test_d="$(dirname "${test_d}")"
          parents=$((parents - 1))
      done
      printf "Couldn't find .venv upto mountpoint %s\n" "${test_d}" >&2
      unset parents test_d env_d
      return 126
  }
#+END_SRC

*** Virtualenv in prompt string
#+BEGIN_SRC sh :tangle ../env/shrc
  _rc_show_venv () {
      # if a virtualenv is active, print it's name
      if [ -n "${VIRTUAL_ENV}" ]; then
          base="$(basename "${VIRTUAL_ENV}")"
          if [ "${base}" = ".venv" ] || [ "${base}" = "venv"  ]; then
              printf "/%s" "$(basename "$(dirname "${VIRTUAL_ENV}")")"
              unset base
          else
              printf "/%s" "${base}"
              unset base
          fi
      fi
  }
#+END_SRC
** Vterm printf
#+begin_src sh :tangle ../env/shrc
  vterm_printf() {
      if [ -n "$TMUX" ] && ([ "${TERM%%-*}" = "tmux" ] || [ "${TERM%%-*}" = "screen" ]); then
          # Tell tmux to pass the escape sequences through
          printf "\ePtmux;\e\e]%s\007\e\\" "$1"
      elif [ "${TERM%%-*}" = "screen" ]; then
          # GNU screen (screen, screen-256color, screen-256color-bce)
          printf "\eP\e]%s\007\e\\" "$1"
      else
          printf "\e]%s\e\\" "$1"
      fi
  }
#+end_src 

** Vterm message passing 
#+begin_src sh :tangle ../env/shrc
    vterm_cmd() {
        local vterm_elisp
        vterm_elisp=""
        while [ $# -gt 0 ]; do
            vterm_elisp="$vterm_elisp""$(printf '"%s" ' "$(printf "%s" "$1" | sed -e 's|\\|\\\\|g' -e 's|"|\\"|g')")"
            shift
        done
        vterm_printf "51;E$vterm_elisp"
    }
#+end_src

** Git
