docs/index.html

<div id="outline-container-org541dcbd" class="outline-4">
<h4 id="org541dcbd">Quickly change to virtualenv</h4>
<div class="outline-text-4" id="text-org541dcbd">
<p>
Scan up to mount-point, if any direct parent has .venv, source that &ldquo;.venv/bin/activate&rdquo;
This may require shell-identification for ksh, csh, fish since they have a different activate
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">Walk upto mount-point (if within 16 levels) and look for</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">'.venv' directory that contains python</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">virtual environment. If found, switch to it</span>
<span class="org-function-name">to_venv</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-variable-name">test_d</span>=<span class="org-string">"$(readlink -f "${PWD}")"</span>
    <span class="org-variable-name">parents</span>=16  <span class="org-comment-delimiter"># </span><span class="org-comment">path too long to waste time</span>
    <span class="org-keyword">until</span> mountpoint <span class="org-string">"${test_d}"</span> &gt; /dev/null 2&gt; /dev/null; <span class="org-keyword">do</span>
        <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> $<span class="org-variable-name">parents</span> -le 0 <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
            printf <span class="org-string">"Too many branch-nodes searched"</span> &gt;&amp;2
            <span class="org-builtin">unset</span> parents test_d env_d
            <span class="org-keyword">return</span> 126
        <span class="org-keyword">fi</span>
        <span class="org-keyword">for</span> env_d<span class="org-keyword"> in</span> <span class="org-string">".venv"</span> <span class="org-string">"venv"</span>; <span class="org-keyword">do</span>
            <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -d <span class="org-string">"${test_d}/${env_d}"</span> <span class="org-rainbow-delimiters-depth-2">]</span> <span class="org-sh-escaped-newline">\</span>
                   || <span class="org-rainbow-delimiters-depth-2">[</span> -L <span class="org-string">"${test_d}/${env_d}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
                <span class="org-comment-delimiter"># </span><span class="org-comment">shellcheck disable=SC1090</span>
                . <span class="org-string">"${test_d}/${env_d}/bin/activate"</span>
                printf <span class="org-string">"Found %s, switching...\n"</span> <span class="org-string">"${test_d}/${env_d}"</span>
                <span class="org-builtin">unset</span> parents test_d env_d
                <span class="org-keyword">return</span> 0
            <span class="org-keyword">fi</span>
        <span class="org-keyword">done</span>
        <span class="org-variable-name">test_d</span>=<span class="org-string">"$(dirname "${test_d}")"</span>
        <span class="org-variable-name">parents</span>=$<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">(</span>parents - 1<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
    <span class="org-keyword">done</span>
    printf <span class="org-string">"Couldn't find .venv upto mountpoint %s\n"</span> <span class="org-string">"${test_d}"</span> &gt;&amp;2
    <span class="org-builtin">unset</span> parents test_d env_d
    <span class="org-keyword">return</span> 126
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfc1cc04" class="outline-4">
<h4 id="orgfc1cc04">Virtualenv in prompt string</h4>
<div class="outline-text-4" id="text-orgfc1cc04">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-function-name">_rc_show_venv</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">if a virtualenv is active, print it's name</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -n <span class="org-string">"${VIRTUAL_ENV}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-variable-name">base</span>=<span class="org-string">"$(basename "${VIRTUAL_ENV}")"</span>
        <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-string">"${base}"</span> = <span class="org-string">".venv"</span> <span class="org-rainbow-delimiters-depth-2">]</span> || <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-string">"${base}"</span> = <span class="org-string">"venv"</span>  <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
            printf <span class="org-string">"/%s"</span> <span class="org-string">"$(basename "$(dirname "${VIRTUAL_ENV}")")"</span>
            <span class="org-builtin">unset</span> base
        <span class="org-keyword">else</span>
            printf <span class="org-string">"/%s"</span> <span class="org-string">"${base}"</span>
            <span class="org-builtin">unset</span> base
        <span class="org-keyword">fi</span>
    <span class="org-keyword">fi</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org1231eae" class="outline-3">
<h3 id="org1231eae">Vterm printf</h3>
<div class="outline-text-3" id="text-org1231eae">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-function-name">vterm_printf</span><span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -n <span class="org-string">"$TMUX"</span> <span class="org-rainbow-delimiters-depth-2">]</span> &amp;&amp; <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">[</span> <span class="org-string">"${TERM%%-*}"</span> = <span class="org-string">"tmux"</span> <span class="org-rainbow-delimiters-depth-3">]</span> || <span class="org-rainbow-delimiters-depth-3">[</span> <span class="org-string">"${TERM%%-*}"</span> = <span class="org-string">"screen"</span> <span class="org-rainbow-delimiters-depth-3">]</span><span class="org-rainbow-delimiters-depth-2">)</span>; <span class="org-keyword">then</span>
        <span class="org-comment-delimiter"># </span><span class="org-comment">Tell tmux to pass the escape sequences through</span>
        printf <span class="org-string">"\ePtmux;\e\e]%s\007\e\\"</span> <span class="org-string">"$1"</span>
    <span class="org-keyword">elif</span> <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-string">"${TERM%%-*}"</span> = <span class="org-string">"screen"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-comment-delimiter"># </span><span class="org-comment">GNU screen (screen, screen-256color, screen-256color-bce)</span>
        printf <span class="org-string">"\eP\e]%s\007\e\\"</span> <span class="org-string">"$1"</span>
    <span class="org-keyword">else</span>
        printf <span class="org-string">"\e]%s\e\\"</span> <span class="org-string">"$1"</span>
    <span class="org-keyword">fi</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org0ea56db" class="outline-3">
<h3 id="org0ea56db">Vterm message passing</h3>
<div class="outline-text-3" id="text-org0ea56db">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-function-name">vterm_cmd</span><span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-builtin">local</span> vterm_elisp
    <span class="org-variable-name">vterm_elisp</span>=<span class="org-string">""</span>
    <span class="org-keyword">while</span> <span class="org-rainbow-delimiters-depth-2">[</span> $<span class="org-variable-name">#</span> -gt 0 <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">do</span>
        <span class="org-variable-name">vterm_elisp</span>=<span class="org-string">"$vterm_elisp""$(printf '"%s" ' "$(printf "%s" "$1" | sed -e 's|\\|\\\\|g' -e 's|"|\\"|g')")"</span>
        <span class="org-builtin">shift</span>
    <span class="org-keyword">done</span>
    vterm_printf <span class="org-string">"51;E$vterm_elisp"</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>
