org/index.org
*** Status
#+BEGIN_SRC sh :tangle ../env/shrc
  git_status() {
      _modified=0
      _cached=0
      _untracked=0

      while read -r _line; do
          case "${_line}" in
              _*_\ _)
                  _cached=1
                  ;;
              _\ _*_)
                  _modified=1
                  ;;
              _?_?_)
                  _untracked=1
                  ;;
          esac
      done << endstat
  $(git status --short | cut -b -2 | sed -e 's/\(.\)\(.*\)/_\1_\2_/')
  endstat

      _stat_str=''
      if [ "$_modified" -ne 0 ]; then
          _stat_str="${_stat_str}\033[0;31m\ue728"
      fi

      if [ "$_cached" -ne 0 ]; then
          _stat_str="${_stat_str}\033[0;32m\ue729"
      fi

      if [ "$_untracked" -ne 0 ]; then
          _stat_str="${_stat_str}\033[0;31m\uf476"
      fi

      if [ -n "$(git stash list)" ]; then
          _stat_str="${_stat_str}\e[0;36m\uf48e"
      fi
      if [ -n "${_stat_str}" ]; then
          # shellcheck disable=SC2059  # I do want escape characters
          printf "${_stat_str}\e[m"
      fi
      unset _modified _cached _untracked _stat_str
  }
#+END_SRC

*** Branch
#+BEGIN_SRC sh :tangle ../env/shrc
  git_branch() {
      branch_str=''
      branch="$(git branch 2>/dev/null | grep '^\*' | sed -e 's/^* //')"
      if [ -n "${branch}" ]; then
          case "${branch}" in
              feat-*)
                  branch_str="${branch_str}\033[0;32m"
                  ;;
              bug-*)
                  branch_str="${branch_str}\033[0;31m"
                  ;;
              act-*)
                  branch_str="${branch_str}\e[0;36m"
                  ;;
              tmp-*)
                  branch_str="${branch_str}\e[0;36m"
                  ;;
              ,*HEAD\ detached*|,*rebasing*)
                  branch_str="${branch_str}\e[0;33m"
                  ;;
              main|master)
                  unset branch branch_str
                  return
                  ;;
              ,*)
                  branch_str="${branch_str}\e[0;35m"
                  ;;
          esac
      fi
      printf "${branch_str}%s\ue725\e[m" "${branch}"
      unset branch_str branch
  }

#+END_SRC
*** Hash
#+BEGIN_SRC sh :tangle ../env/shrc
  git_hash() {
      git log --pretty=format:'%h' -n 1
  }
#+END_SRC

*** Prompt string
Include git's branch, hash, status in PS1 if in git repository
This function is called in PS1 section below
#+NAME: Git PS
#+BEGIN_SRC sh :tangle ../env/shrc
  git_ps() {
      if ! git status --ignore-submodules >/dev/null 2>&1; then
          return
      else
          printf " %s%s%s " "$(git_branch)" "$(git_hash)" "$(git_status)"
      fi
  }
#+END_SRC

** Prompt String
*** Exit_colour
#+BEGIN_SRC sh :tangle ../env/shrc
  # Print ANSI terminal escape codes for colors according to exit status
  # of latest (last) executed command
  _rc_last_exit_color () {
      case "$1" in
          0)
              # success
              printf "\e[0;32m"
              ;;
          1)
              # general error
              printf "\e[0;33m"
              ;;
          2)
              # misuse of shell builtins
              printf "\e[0;31m"
              ;;
          126)
              # cannot execute
              printf "\e[0;37m"
              ;;
          127)
              # command not found
              printf "\e[0;30m"
              ;;
          255)
              # exit status limit
              printf "\e[0;31m"
              ;;
          ,*)
              if [ "$1" -gt "63" ] && [ "$1" -lt "84" ]; then
                  # syserror.h
                  printf "\e[0;91m"

              elif [ "$1" -gt "127" ] && [ "$1" -lt "191" ]; then
                  # Fatal error
                  printf "\e[0;41m"
              else
                  printf "\e[0;31m"
              fi
              unset _err
              ;;
      esac
  }
#+END_SRC

