docs/index.html

<div id="outline-container-org57c6a1c" class="outline-3">
<h3 id="org57c6a1c">Git</h3>
<div class="outline-text-3" id="text-org57c6a1c">
</div>
<div id="outline-container-org8a0421f" class="outline-4">
<h4 id="org8a0421f">Status</h4>
<div class="outline-text-4" id="text-org8a0421f">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-function-name">git_status</span><span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-variable-name">_modified</span>=0
    <span class="org-variable-name">_cached</span>=0
    <span class="org-variable-name">_untracked</span>=0

    <span class="org-keyword">while </span><span class="org-builtin">read</span> -r _line; <span class="org-keyword">do</span>
        <span class="org-keyword">case</span> <span class="org-string">"${_line}"</span><span class="org-keyword"> in</span>
            _*_<span class="org-string">\ </span>_)
                <span class="org-variable-name">_cached</span>=1
                ;;
            _<span class="org-string">\ </span>_*_)
                <span class="org-variable-name">_modified</span>=1
                ;;
            _?_?_)
                <span class="org-variable-name">_untracked</span>=1
                ;;
        <span class="org-keyword">esac</span>
    <span class="org-keyword">done</span> &lt;&lt; endstat
<span class="org-sh-heredoc">$(git status --short | cut -b -2 | sed -e 's/\(.\)\(.*\)/_\1_\2_/')</span>
<span class="org-sh-heredoc">endstat</span>

    <span class="org-variable-name">_stat_str</span>=<span class="org-string">''</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-string">"$_modified"</span> -ne 0 <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-variable-name">_stat_str</span>=<span class="org-string">"${_stat_str}\033[0;31m\ue728"</span>
    <span class="org-keyword">fi</span>

    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-string">"$_cached"</span> -ne 0 <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-variable-name">_stat_str</span>=<span class="org-string">"${_stat_str}\033[0;32m\ue729"</span>
    <span class="org-keyword">fi</span>

    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-string">"$_untracked"</span> -ne 0 <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-variable-name">_stat_str</span>=<span class="org-string">"${_stat_str}\033[0;31m\uf476"</span>
    <span class="org-keyword">fi</span>

    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -n <span class="org-string">"$(git stash list)"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-variable-name">_stat_str</span>=<span class="org-string">"${_stat_str}\e[0;36m\uf48e"</span>
    <span class="org-keyword">fi</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -n <span class="org-string">"${_stat_str}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-comment-delimiter"># </span><span class="org-comment">shellcheck disable=SC2059  # I do want escape characters</span>
        printf <span class="org-string">"${_stat_str}\e[m"</span>
    <span class="org-keyword">fi</span>
    <span class="org-builtin">unset</span> _modified _cached _untracked _stat_str
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org80a003e" class="outline-4">
<h4 id="org80a003e">Branch</h4>
<div class="outline-text-4" id="text-org80a003e">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-function-name">git_branch</span><span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-variable-name">branch_str</span>=<span class="org-string">''</span>
    <span class="org-variable-name">branch</span>=<span class="org-string">"$(git branch 2&gt;/dev/null | grep '^\*' | sed -e 's/^* //')"</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -n <span class="org-string">"${branch}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-keyword">case</span> <span class="org-string">"${branch}"</span><span class="org-keyword"> in</span>
            feat-*)
                <span class="org-variable-name">branch_str</span>=<span class="org-string">"${branch_str}\033[0;32m"</span>
                ;;
            bug-*)
                <span class="org-variable-name">branch_str</span>=<span class="org-string">"${branch_str}\033[0;31m"</span>
                ;;
            act-*)
                <span class="org-variable-name">branch_str</span>=<span class="org-string">"${branch_str}\e[0;36m"</span>
                ;;
            tmp-*)
                <span class="org-variable-name">branch_str</span>=<span class="org-string">"${branch_str}\e[0;36m"</span>
                ;;
            *HEAD<span class="org-string">\ </span>detached*|,*rebasing*)
                <span class="org-variable-name">branch_str</span>=<span class="org-string">"${branch_str}\e[0;33m"</span>
                ;;
            main|master)
                <span class="org-builtin">unset</span> branch branch_str
                <span class="org-keyword">return</span>
                ;;
            *)
                <span class="org-variable-name">branch_str</span>=<span class="org-string">"${branch_str}\e[0;35m"</span>
                ;;
        <span class="org-keyword">esac</span>
    <span class="org-keyword">fi</span>
    printf <span class="org-string">"${branch_str}%s\ue725\e[m"</span> <span class="org-string">"${branch}"</span>
    <span class="org-builtin">unset</span> branch_str branch
<span class="org-rainbow-delimiters-depth-1">}</span>

</pre>
</div>
</div>
</div>
<div id="outline-container-org65920e9" class="outline-4">
<h4 id="org65920e9">Hash</h4>
<div class="outline-text-4" id="text-org65920e9">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-function-name">git_hash</span><span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    git log --pretty=format:<span class="org-string">'%h'</span> -n 1
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org871b887" class="outline-4">
<h4 id="org871b887">Prompt string</h4>
<div class="outline-text-4" id="text-org871b887">
<p>
Include git&rsquo;s branch, hash, status in PS1 if in git repository
This function is called in PS1 section below
</p>
<div class="org-src-container">
<pre class="src src-sh" id="org611860a"><span class="org-function-name">git_ps</span><span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-keyword">if</span> <span class="org-negation-char">!</span> git status --ignore-submodules &gt;/dev/null 2&gt;&amp;1; <span class="org-keyword">then</span>
        <span class="org-keyword">return</span>
    <span class="org-keyword">else</span>
        printf <span class="org-string">" %s%s%s "</span> <span class="org-string">"$(git_branch)"</span> <span class="org-string">"$(git_hash)"</span> <span class="org-string">"$(git_status)"</span>
    <span class="org-keyword">fi</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org5b5b96b" class="outline-3">
<h3 id="org5b5b96b">Prompt String</h3>
<div class="outline-text-3" id="text-org5b5b96b">
</div>
<div id="outline-container-orgfd34b71" class="outline-4">
<h4 id="orgfd34b71">Exit_colour</h4>
<div class="outline-text-4" id="text-orgfd34b71">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">Print ANSI terminal escape codes for colors according to exit status</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">of latest (last) executed command</span>
<span class="org-function-name">_rc_last_exit_color</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-keyword">case</span> <span class="org-string">"$1"</span><span class="org-keyword"> in</span>
        0)
            <span class="org-comment-delimiter"># </span><span class="org-comment">success</span>
            printf <span class="org-string">"\e[0;32m"</span>
            ;;
        1)
            <span class="org-comment-delimiter"># </span><span class="org-comment">general error</span>
            printf <span class="org-string">"\e[0;33m"</span>
            ;;
        2)
            <span class="org-comment-delimiter"># </span><span class="org-comment">misuse of shell builtins</span>
            printf <span class="org-string">"\e[0;31m"</span>
            ;;
        126)
            <span class="org-comment-delimiter"># </span><span class="org-comment">cannot execute</span>
            printf <span class="org-string">"\e[0;37m"</span>
            ;;
        127)
            <span class="org-comment-delimiter"># </span><span class="org-comment">command not found</span>
            printf <span class="org-string">"\e[0;30m"</span>
            ;;
        255)
            <span class="org-comment-delimiter"># </span><span class="org-comment">exit status limit</span>
            printf <span class="org-string">"\e[0;31m"</span>
            ;;
        *)
            <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-string">"$1"</span> -gt <span class="org-string">"63"</span> <span class="org-rainbow-delimiters-depth-2">]</span> &amp;&amp; <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-string">"$1"</span> -lt <span class="org-string">"84"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
                <span class="org-comment-delimiter"># </span><span class="org-comment">syserror.h</span>
                printf <span class="org-string">"\e[0;91m"</span>

            <span class="org-keyword">elif</span> <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-string">"$1"</span> -gt <span class="org-string">"127"</span> <span class="org-rainbow-delimiters-depth-2">]</span> &amp;&amp; <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-string">"$1"</span> -lt <span class="org-string">"191"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
                <span class="org-comment-delimiter"># </span><span class="org-comment">Fatal error</span>
                printf <span class="org-string">"\e[0;41m"</span>
            <span class="org-keyword">else</span>
                printf <span class="org-string">"\e[0;31m"</span>
            <span class="org-keyword">fi</span>
            <span class="org-builtin">unset</span> _err
            ;;
    <span class="org-keyword">esac</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>
