org/index.org
*** Elapsed_time
#+BEGIN_SRC sh :tangle ../env/shrc
  # Calculate time elapsed (min/sec) while executing last command
  _elapsed_time() {
      # $1 is start time $2 is end time
      _cmd_start="$1"
      _cmd_end="$2"
      if [ -z "$_cmd_end" ] || [ -z "$_cmd_start" ]; then
          return
      fi
      _sec=$(( _cmd_end - _cmd_start ))
      unset _cmd_start _cmd_end
      if [ "$_sec" -le 0 ]; then
          return
      fi
      if [ "$_sec" -le 60 ]; then
          printf "%s" "${_sec}"
          unset _sec
          return
      fi
      _min=$(( _sec/60 ))
      unset _sec
      if [ "$_min" -le 60 ]; then
          printf "%sm" "${_min}"
          unset _min
          return
      fi
      _hr=$(( _min/60 ))
      unset _min
      if [ "$_hr" -le 24 ]; then
          printf "%sh" "${_hr}"
          unset _hr
          return
      fi
      _day=$(( _hr/24 ))
      printf "%sd" "${_day}"
      unset _min _day
  }
#+END_SRC

*** PROMPT_COMMAND
**** bash
#+BEGIN_SRC bash :tangle ../dotfiles/.bashrc
  # export PROMPT_COMMAND=__prompt_command

  preexec() {
      _cmd_start_t="${SECONDS}"
  }

  precmd () {
      _exit_color="$(_rc_last_exit_color $?)"

      _elapsed="$(_elapsed_time $_cmd_start_t ${SECONDS})"
      unset _cmd_start_t

      # unset previous
      PS1=""
      PS2=""
      PS3=""
      PS4=""
      RPROMPT=""

      PS1+="\[\e[0;32m\]\u\[\e[m\]"
      PS1+="\[\e[3;35m\]\$(_rc_show_venv)\[\e[m\]"
      PS1+="@"
      PS1+="\[\e[0;34m\]\h\[\e[m\]"
      PS1+="\$(git_ps)"
      PS1+="\[\e[0;36m\]:\W"
      PS1+="\[\e[0;37m\]"

      PS1+="$(date '+%H:%M:%S')"
      PS1+=" ${_exit_color}-${_elapsed}"
      PS1+='\[\e[m\]\n» '

      PS2=""
      PS2+="\[\e[0;36m\]cont..."
      PS2+="\[\e[m\]"
      PS2+="» ";

      PS3='Selection: ';
  }
#+END_SRC

**** zsh
#+BEGIN_SRC bash :tangle ../dotfiles/.zshrc
  _rc_pspexec() {
      _cmd_start_t="${SECONDS}"
  }

  _rc_pspps () {
      _exit_color="$(_rc_last_exit_color $?)"

      _elapsed="$(_elapsed_time $_cmd_start_t ${SECONDS})"
      unset _cmd_start_t

      # unset previous
      PS1=$''
      PS2=$''
      PS3=$''
      PS4=$''
      RPROMPT=$''

      PS1+=$'%{\e[0;32m%}%n%{\e[m%}'
      PS1+=$'%{\e[3;35m%}'
      PS1+="$(_rc_show_venv)"
      PS1+=$'%{\e[m%}'
      PS1+=$'@'
      PS1+=$'%{\e[0;34m%}%m%{\e[m%}'
      PS1+="$(git_ps)"
      PS1+=$'%{\e[0;36m%}:%1~'
      PS1+=$'%{\e[0;37m%}\n%{\e[m%}» '

      PS2+=$'%{\e[0;36m%}cont...'
      PS2+=$'%{\e[m%}'
      PS2+=$'» '

      PS3='Selection: '

      RPROMPT+=$'%*'
      RPROMPT+="%{$_exit_color%}-${_elapsed}"
      RPROMPT+=$'%{\e[m%}'
      unset _exit_stat _elapsed
  }

  add-zsh-hook precmd _rc_pspps
  add-zsh-hook preexec _rc_pspexec

#+END_SRC

** Mathematical
*** In-Line Calculator
#+BEGIN_SRC sh :tangle ../env/shrc
  # quick cmoonad line calculator
  mathcalc() {
      echo "$*"| bc -lq
  }
#+END_SRC

*** Computational
#+BEGIN_SRC sh :tangle ../env/shrc
  # convert from decimal to hexadecimal and back
  dec2hex() {
      echo "hex:"
      echo "obase=16; $*"| bc
      echo "dec:"
      echo "ibase=16; $*"| bc
  }
#+END_SRC

