docs/index.html

<div id="outline-container-org214dc5f" class="outline-4">
<h4 id="org214dc5f">Elapsed_time</h4>
<div class="outline-text-4" id="text-org214dc5f">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">Calculate time elapsed (min/sec) while executing last command</span>
<span class="org-function-name">_elapsed_time</span><span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">$1 is start time $2 is end time</span>
    <span class="org-variable-name">_cmd_start</span>=<span class="org-string">"$1"</span>
    <span class="org-variable-name">_cmd_end</span>=<span class="org-string">"$2"</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -z <span class="org-string">"$_cmd_end"</span> <span class="org-rainbow-delimiters-depth-2">]</span> || <span class="org-rainbow-delimiters-depth-2">[</span> -z <span class="org-string">"$_cmd_start"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-keyword">return</span>
    <span class="org-keyword">fi</span>
    <span class="org-variable-name">_sec</span>=$<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">(</span> _cmd_end - _cmd_start <span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
    <span class="org-builtin">unset</span> _cmd_start _cmd_end
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-string">"$_sec"</span> -le 0 <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-keyword">return</span>
    <span class="org-keyword">fi</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-string">"$_sec"</span> -le 60 <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        printf <span class="org-string">"%s"</span> <span class="org-string">"${_sec}"</span>
        <span class="org-builtin">unset</span> _sec
        <span class="org-keyword">return</span>
    <span class="org-keyword">fi</span>
    <span class="org-variable-name">_min</span>=$<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">(</span> _sec/60 <span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
    <span class="org-builtin">unset</span> _sec
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-string">"$_min"</span> -le 60 <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        printf <span class="org-string">"%sm"</span> <span class="org-string">"${_min}"</span>
        <span class="org-builtin">unset</span> _min
        <span class="org-keyword">return</span>
    <span class="org-keyword">fi</span>
    <span class="org-variable-name">_hr</span>=$<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">(</span> _min/60 <span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
    <span class="org-builtin">unset</span> _min
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-string">"$_hr"</span> -le 24 <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        printf <span class="org-string">"%sh"</span> <span class="org-string">"${_hr}"</span>
        <span class="org-builtin">unset</span> _hr
        <span class="org-keyword">return</span>
    <span class="org-keyword">fi</span>
    <span class="org-variable-name">_day</span>=$<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">(</span> _hr/24 <span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
    printf <span class="org-string">"%sd"</span> <span class="org-string">"${_day}"</span>
    <span class="org-builtin">unset</span> _min _day
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org488a519" class="outline-4">
<h4 id="org488a519">PROMPT_COMMAND</h4>
<div class="outline-text-4" id="text-org488a519">
</div>
<ul class="org-ul">
<li><a id="org482fd2b"></a>bash<br />
<div class="outline-text-5" id="text-org482fd2b">
<div class="org-src-container">
<pre class="src src-bash"><span class="org-comment-delimiter"># </span><span class="org-comment">export PROMPT_COMMAND=__prompt_command</span>

<span class="org-function-name">preexec</span><span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-variable-name">_cmd_start_t</span>=<span class="org-string">"${SECONDS}"</span>
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-function-name">precmd</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-variable-name">_exit_color</span>=<span class="org-string">"$(_rc_last_exit_color $?)"</span>

    <span class="org-variable-name">_elapsed</span>=<span class="org-string">"$(_elapsed_time $_cmd_start_t ${SECONDS})"</span>
    <span class="org-builtin">unset</span> _cmd_start_t

    <span class="org-comment-delimiter"># </span><span class="org-comment">unset previous</span>
    <span class="org-variable-name">PS1</span>=<span class="org-string">""</span>
    <span class="org-variable-name">PS2</span>=<span class="org-string">""</span>
    <span class="org-variable-name">PS3</span>=<span class="org-string">""</span>
    <span class="org-variable-name">PS4</span>=<span class="org-string">""</span>
    <span class="org-variable-name">RPROMPT</span>=<span class="org-string">""</span>

    <span class="org-variable-name">PS1</span>+=<span class="org-string">"\[\e[0;32m\]\u\[\e[m\]"</span>
    <span class="org-variable-name">PS1</span>+=<span class="org-string">"\[\e[3;35m\]\$(_rc_show_venv)\[\e[m\]"</span>
    <span class="org-variable-name">PS1</span>+=<span class="org-string">"@"</span>
    <span class="org-variable-name">PS1</span>+=<span class="org-string">"\[\e[0;34m\]\h\[\e[m\]"</span>
    <span class="org-variable-name">PS1</span>+=<span class="org-string">"\$(git_ps)"</span>
    <span class="org-variable-name">PS1</span>+=<span class="org-string">"\[\e[0;36m\]:\W"</span>
    <span class="org-variable-name">PS1</span>+=<span class="org-string">"\[\e[0;37m\]"</span>

    <span class="org-variable-name">PS1</span>+=<span class="org-string">"$(date '+%H:%M:%S')"</span>
    <span class="org-variable-name">PS1</span>+=<span class="org-string">" ${_exit_color}-${_elapsed}"</span>
    <span class="org-variable-name">PS1</span>+=<span class="org-string">'\[\e[m\]\n&#187; '</span>

    <span class="org-variable-name">PS2</span>=<span class="org-string">""</span>
    <span class="org-variable-name">PS2</span>+=<span class="org-string">"\[\e[0;36m\]cont..."</span>
    <span class="org-variable-name">PS2</span>+=<span class="org-string">"\[\e[m\]"</span>
    <span class="org-variable-name">PS2</span>+=<span class="org-string">"&#187; "</span>;

    <span class="org-variable-name">PS3</span>=<span class="org-string">'Selection: '</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</li>

<li><a id="org7fc647f"></a>zsh<br />
<div class="outline-text-5" id="text-org7fc647f">
<div class="org-src-container">
<pre class="src src-bash"><span class="org-function-name">_rc_pspexec</span><span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-variable-name">_cmd_start_t</span>=<span class="org-string">"${SECONDS}"</span>
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-function-name">_rc_pspps</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-variable-name">_exit_color</span>=<span class="org-string">"$(_rc_last_exit_color $?)"</span>

    <span class="org-variable-name">_elapsed</span>=<span class="org-string">"$(_elapsed_time $_cmd_start_t ${SECONDS})"</span>
    <span class="org-builtin">unset</span> _cmd_start_t

    <span class="org-comment-delimiter"># </span><span class="org-comment">unset previous</span>
    <span class="org-variable-name">PS1</span>=$<span class="org-string">''</span>
    <span class="org-variable-name">PS2</span>=$<span class="org-string">''</span>
    <span class="org-variable-name">PS3</span>=$<span class="org-string">''</span>
    <span class="org-variable-name">PS4</span>=$<span class="org-string">''</span>
    <span class="org-variable-name">RPROMPT</span>=$<span class="org-string">''</span>

    <span class="org-variable-name">PS1</span>+=$<span class="org-string">'%{\e[0;32m%}%n%{\e[m%}'</span>
    <span class="org-variable-name">PS1</span>+=$<span class="org-string">'%{\e[3;35m%}'</span>
    <span class="org-variable-name">PS1</span>+=<span class="org-string">"$(_rc_show_venv)"</span>
    <span class="org-variable-name">PS1</span>+=$<span class="org-string">'%{\e[m%}'</span>
    <span class="org-variable-name">PS1</span>+=$<span class="org-string">'@'</span>
    <span class="org-variable-name">PS1</span>+=$<span class="org-string">'%{\e[0;34m%}%m%{\e[m%}'</span>
    <span class="org-variable-name">PS1</span>+=<span class="org-string">"$(git_ps)"</span>
    <span class="org-variable-name">PS1</span>+=$<span class="org-string">'%{\e[0;36m%}:%1~'</span>
    <span class="org-variable-name">PS1</span>+=$<span class="org-string">'%{\e[0;37m%}\n%{\e[m%}&#187; '</span>

    <span class="org-variable-name">PS2</span>+=$<span class="org-string">'%{\e[0;36m%}cont...'</span>
    <span class="org-variable-name">PS2</span>+=$<span class="org-string">'%{\e[m%}'</span>
    <span class="org-variable-name">PS2</span>+=$<span class="org-string">'&#187; '</span>

    <span class="org-variable-name">PS3</span>=<span class="org-string">'Selection: '</span>

    <span class="org-variable-name">RPROMPT</span>+=$<span class="org-string">'%*'</span>
    <span class="org-variable-name">RPROMPT</span>+=<span class="org-string">"%{$_exit_color%}-${_elapsed}"</span>
    <span class="org-variable-name">RPROMPT</span>+=$<span class="org-string">'%{\e[m%}'</span>
    <span class="org-builtin">unset</span> _exit_stat _elapsed
<span class="org-rainbow-delimiters-depth-1">}</span>

add-zsh-hook precmd _rc_pspps
add-zsh-hook preexec _rc_pspexec

</pre>
</div>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-org6606f63" class="outline-3">
<h3 id="org6606f63">Mathematical</h3>
<div class="outline-text-3" id="text-org6606f63">
</div>
<div id="outline-container-org9a0afaa" class="outline-4">
<h4 id="org9a0afaa">In-Line Calculator</h4>
<div class="outline-text-4" id="text-org9a0afaa">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">quick cmoonad line calculator</span>
<span class="org-function-name">mathcalc</span><span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-builtin">echo</span> <span class="org-string">"$*"</span>| bc -lq
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgca614de" class="outline-4">
<h4 id="orgca614de">Computational</h4>
<div class="outline-text-4" id="text-orgca614de">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">convert from decimal to hexadecimal and back</span>
<span class="org-function-name">dec2hex</span><span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-builtin">echo</span> <span class="org-string">"hex:"</span>
    <span class="org-builtin">echo</span> <span class="org-string">"obase=16; $*"</span>| bc
    <span class="org-builtin">echo</span> <span class="org-string">"dec:"</span>
    <span class="org-builtin">echo</span> <span class="org-string">"ibase=16; $*"</span>| bc
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>
</div>
