org/index.org
** Documents compilation
*** PDF from Latex
#+BEGIN_SRC sh :tangle ../env/shrc
  # compile pdf from given latex file using pdflatex
  pdfcompile() {
      if ! builtin command -v "pdflatex" 1>/dev/null 2>&1; then
          printf "pdftex is not installed\n"
          return 127
      fi

      pdflatex "$1"
      for ext in ".toc" ".log" ".aux"; do
          [ -f "${1%.tex}${ext}" ] && rm "${1%.tex}${ext}"
      done
      if builtin command -v "pdflatex" 1>/dev/null 2>&1; then
          zathura "${1%.tex}.pdf"
      fi
  }
#+END_SRC
*** Pandoc
**** Org to Something
#+BEGIN_SRC sh :tangle ../env/shrc
  # export from org to 'other' using pandoc
  # Usage: org2export [-f] <infile> <othtype>
  org2export() {
      if ! builtin command -v "pandoc" 1>/dev/null 2>&1; then
          printf "pandoc is not installed\n"
          return 127
      fi
      proceed=false
      while test $# -gt 1; do
          case "$1" in
              -f|--force)
                  proceed=true
                  shift 1
                  ;;
              -h|--help)
                  printf "Usage: org2export [-h|--help] [-f|--force] FILENAME.org OUTFMT\n\n"
                  printf "Optional Arguments:\n"
                  printf "%s\tshow this help message\n\n" "-h|--help"
                  printf "%s\tignore extension mismatch\n" "-f|--force"
                  printf "Positional Arguments:\n"
                  printf "FILENAME.org\tpath to input filename\n"
                  printf "OUTFMT\t\tformat of output [pdf, docs, ...]\n"
                  return 0
                  ;;
              --)
                  shift 1
                  ;;
              ,*)
                  infile="${1}";
                  target="${2}";
                  break
                  ;;
          esac
      done
      if [ "${target}" = "pdf" ]; then
          target="latex"
      fi
      if [ "${infile%.org}" = "${infile}" ]; then
          # <infile>
          printf "Input file should be an org file\n"
      else
          # <infile>.org
          proceed=true
      fi
      if $proceed; then
          pandoc -f org -t "${target}" -o "${infile%.*}.${1}" "$infile"
      fi
      unset proceed target infile
  }
#+END_SRC

**** Org to Docx
#+BEGIN_SRC sh :tangle ../env/shrc
  # export from org to MS DOCX format using pandoc
  org2doc () {
      org2export "$@" "docx"
  }
#+END_SRC

**** Org to PDF
#+BEGIN_SRC sh :tangle ../env/shrc
  # export from org to pdf format using pandoc
  org2pdf () {
      org2export "$@" "pdf"
  }
#+END_SRC

**** Docx to Org
#+BEGIN_SRC sh :tangle ../env/shrc
  # export from MS DOCX to org mode using pandoc
  doc2org() {
      if ! builtin command -v "pandoc" 1>/dev/null 2>&1; then
          printf "pandoc is not installed\n"
          return 127
      fi

      case "${1}" in
          ,*.docx)
              pandoc -f docx -t org -o "${1%.docx}.org" "$1"
              ;;
          ,*)
              echo "Input file must be a docx file"
              ;;
      esac
  }
#+END_SRC

** Mount over ssh
ssh Cloud mounts
- see [[./cloud_mount.html][cloud_mount]]
  #+BEGIN_SRC sh :tangle ../env/shrc
    # mount standard cloud locations using sshfs (read doc)
    mount_cloud_sshfs() {
        mount_script="${RUNCOMDIR:-${HOME}/.runcom}/bin/cloud_mount.sh"
        if [ -f "${mount_script}" ]; then
            eval "${mount_script}"
        fi
    }

    # unmount standard cloud locations using sshfs (read doc)
    umount_cloud_sshfs() {
        mount_script="${RUNCOMDIR:-${HOME}/.runcom}/bin/cloud_mount.sh"
        if [ -f "${mount_script}" ]; then
            eval "${mount_script}" "umount"
        fi
    }

  #+END_SRC

