docs/index.html

<div id="outline-container-orga3d863b" class="outline-3">
<h3 id="orga3d863b">Documents compilation</h3>
<div class="outline-text-3" id="text-orga3d863b">
</div>
<div id="outline-container-org246841a" class="outline-4">
<h4 id="org246841a">PDF from Latex</h4>
<div class="outline-text-4" id="text-org246841a">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">compile pdf from given latex file using pdflatex</span>
<span class="org-function-name">pdfcompile</span><span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-keyword">if ! </span><span class="org-builtin">builtin</span> command -v <span class="org-string">"pdflatex"</span> 1&gt;/dev/null 2&gt;&amp;1; <span class="org-keyword">then</span>
        printf <span class="org-string">"pdftex is not installed\n"</span>
        <span class="org-keyword">return</span> 127
    <span class="org-keyword">fi</span>

    pdflatex <span class="org-string">"$1"</span>
    <span class="org-keyword">for</span> ext<span class="org-keyword"> in</span> <span class="org-string">".toc"</span> <span class="org-string">".log"</span> <span class="org-string">".aux"</span>; <span class="org-keyword">do</span>
        <span class="org-rainbow-delimiters-depth-2">[</span> -f <span class="org-string">"${1%.tex}${ext}"</span> <span class="org-rainbow-delimiters-depth-2">]</span> &amp;&amp; rm <span class="org-string">"${1%.tex}${ext}"</span>
    <span class="org-keyword">done</span>
    <span class="org-keyword">if </span><span class="org-builtin">builtin</span> command -v <span class="org-string">"pdflatex"</span> 1&gt;/dev/null 2&gt;&amp;1; <span class="org-keyword">then</span>
        zathura <span class="org-string">"${1%.tex}.pdf"</span>
    <span class="org-keyword">fi</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd1ff62e" class="outline-4">
<h4 id="orgd1ff62e">Pandoc</h4>
<div class="outline-text-4" id="text-orgd1ff62e">
</div>
<ul class="org-ul">
<li><a id="org03b2848"></a>Org to Something<br />
<div class="outline-text-5" id="text-org03b2848">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">export from org to 'other' using pandoc</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Usage: org2export [-f] &lt;infile&gt; &lt;othtype&gt;</span>
<span class="org-function-name">org2export</span><span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-keyword">if ! </span><span class="org-builtin">builtin</span> command -v <span class="org-string">"pandoc"</span> 1&gt;/dev/null 2&gt;&amp;1; <span class="org-keyword">then</span>
        printf <span class="org-string">"pandoc is not installed\n"</span>
        <span class="org-keyword">return</span> 127
    <span class="org-keyword">fi</span>
    <span class="org-variable-name">proceed</span>=false
    <span class="org-keyword">while</span> test $<span class="org-variable-name">#</span> -gt 1; <span class="org-keyword">do</span>
        <span class="org-keyword">case</span> <span class="org-string">"$1"</span><span class="org-keyword"> in</span>
            -f|--force)
                <span class="org-variable-name">proceed</span>=true
                <span class="org-builtin">shift</span> 1
                ;;
            -h|--help)
                printf <span class="org-string">"Usage: org2export [-h|--help] [-f|--force] FILENAME.org OUTFMT\n\n"</span>
                printf <span class="org-string">"Optional Arguments:\n"</span>
                printf <span class="org-string">"%s\tshow this help message\n\n"</span> <span class="org-string">"-h|--help"</span>
                printf <span class="org-string">"%s\tignore extension mismatch\n"</span> <span class="org-string">"-f|--force"</span>
                printf <span class="org-string">"Positional Arguments:\n"</span>
                printf <span class="org-string">"FILENAME.org\tpath to input filename\n"</span>
                printf <span class="org-string">"OUTFMT\t\tformat of output [pdf, docs, ...]\n"</span>
                <span class="org-keyword">return</span> 0
                ;;
            --)
                <span class="org-builtin">shift</span> 1
                ;;
            *)
                <span class="org-variable-name">infile</span>=<span class="org-string">"${1}"</span>;
                <span class="org-variable-name">target</span>=<span class="org-string">"${2}"</span>;
                <span class="org-keyword">break</span>
                ;;
        <span class="org-keyword">esac</span>
    <span class="org-keyword">done</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-string">"${target}"</span> = <span class="org-string">"pdf"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-variable-name">target</span>=<span class="org-string">"latex"</span>
    <span class="org-keyword">fi</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-string">"${infile%.org}"</span> = <span class="org-string">"${infile}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-comment-delimiter"># </span><span class="org-comment">&lt;infile&gt;</span>
        printf <span class="org-string">"Input file should be an org file\n"</span>
    <span class="org-keyword">else</span>
        <span class="org-comment-delimiter"># </span><span class="org-comment">&lt;infile&gt;.org</span>
        <span class="org-variable-name">proceed</span>=true
    <span class="org-keyword">fi</span>
    <span class="org-keyword">if</span> $<span class="org-variable-name">proceed</span>; <span class="org-keyword">then</span>
        pandoc -f org -t <span class="org-string">"${target}"</span> -o <span class="org-string">"${infile%.*}.${1}"</span> <span class="org-string">"$infile"</span>
    <span class="org-keyword">fi</span>
    <span class="org-builtin">unset</span> proceed target infile
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</li>

<li><a id="org3c515a9"></a>Org to Docx<br />
<div class="outline-text-5" id="text-org3c515a9">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">export from org to MS DOCX format using pandoc</span>
<span class="org-function-name">org2doc</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    org2export <span class="org-string">"$@"</span> <span class="org-string">"docx"</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</li>

<li><a id="orgecc2cb7"></a>Org to PDF<br />
<div class="outline-text-5" id="text-orgecc2cb7">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">export from org to pdf format using pandoc</span>
<span class="org-function-name">org2pdf</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    org2export <span class="org-string">"$@"</span> <span class="org-string">"pdf"</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</li>

<li><a id="org239ee06"></a>Docx to Org<br />
<div class="outline-text-5" id="text-org239ee06">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">export from MS DOCX to org mode using pandoc</span>
<span class="org-function-name">doc2org</span><span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-keyword">if ! </span><span class="org-builtin">builtin</span> command -v <span class="org-string">"pandoc"</span> 1&gt;/dev/null 2&gt;&amp;1; <span class="org-keyword">then</span>
        printf <span class="org-string">"pandoc is not installed\n"</span>
        <span class="org-keyword">return</span> 127
    <span class="org-keyword">fi</span>

    <span class="org-keyword">case</span> <span class="org-string">"${1}"</span><span class="org-keyword"> in</span>
        *.docx)
            pandoc -f docx -t org -o <span class="org-string">"${1%.docx}.org"</span> <span class="org-string">"$1"</span>
            ;;
        *)
            <span class="org-builtin">echo</span> <span class="org-string">"Input file must be a docx file"</span>
            ;;
    <span class="org-keyword">esac</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-org8d159b4" class="outline-3">
<h3 id="org8d159b4">Mount over ssh</h3>
<div class="outline-text-3" id="text-org8d159b4">
<p>
ssh Cloud mounts
</p>
<ul class="org-ul">
<li><p>
see <a href="./cloud_mount.html">cloud_mount</a>
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">mount standard cloud locations using sshfs (read doc)</span>
<span class="org-function-name">mount_cloud_sshfs</span><span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-variable-name">mount_script</span>=<span class="org-string">"${RUNCOMDIR:-${HOME}/.runcom}/bin/cloud_mount.sh"</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -f <span class="org-string">"${mount_script}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-builtin">eval</span> <span class="org-string">"${mount_script}"</span>
    <span class="org-keyword">fi</span>
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">unmount standard cloud locations using sshfs (read doc)</span>
<span class="org-function-name">umount_cloud_sshfs</span><span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-variable-name">mount_script</span>=<span class="org-string">"${RUNCOMDIR:-${HOME}/.runcom}/bin/cloud_mount.sh"</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -f <span class="org-string">"${mount_script}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-builtin">eval</span> <span class="org-string">"${mount_script}"</span> <span class="org-string">"umount"</span>
    <span class="org-keyword">fi</span>
<span class="org-rainbow-delimiters-depth-1">}</span>

</pre>
</div></li>
</ul>
</div>
</div>
