org/index.org
** Launch GUI
Launch application and exit terminal window
Acts like a launcher
Un-interactive terminal commands may also be called
Code is tangled in gui.org
#+BEGIN_SRC sh :tangle ../env/shrc
  # Launch command and kill current shell if command exists
  gui () {
      "${RUNCOM:-${HOME}/.runcom}/bin/gui.sh" "$*"
      if [ $? = 65 ]; then
          # if bin/gui.sh returns 65, kill shell, else, maintain
          exit 0
      fi
  }
#+END_SRC

** Un-Compress by context
#+BEGIN_SRC sh :tangle ../env/shrc
  # uncompress using appropriate protocol (guessed from extension)
  deconvolute() {
      if builtin command -v "pigz" >/dev/null 2>&1; then
          _gzip="pigz"
      else
          _gzip='gzip'
      fi
      if [ ! -f "${1}" ]; then
          echo "${1}: no such file";
      else
          case "${1}" in
              ,*.tar.bz2) tar -xjf "${1}" ;;
              ,*.tbz2) tar -xjf "${1}" ;;
              ,*.tar.gz) tar -x --use-compress-program="${_gzip}" -f "${1}" ;;
              ,*.tgz) tar -x --use-compress-program="${_gzip}" -f "${1}" ;;
              ,*.gz) unpigz "${1}" || gunzip "${1}" ;;
              ,*.rar) unrar -x "${1}" ;;
              ,*.tar) tar -xf "${1}" ;;
              ,*.zip) unzip "${1}" ;;
              ,*.tar.xz) tar -xf "${1}" ;;
              ,*) echo "Cannot extract ${1}, provide explicit command";;
          esac
      fi
      unset _gzip
  }
#+END_SRC

** Navigate
- When no virtualenv is active, but one is available, switch to it
  #+BEGIN_SRC sh :tangle ../env/shrc
    cd () {
        if [ -z "${1}" ]; then
            builtin cd "${HOME}" || true
        else
            builtin cd "${1}"  || true
        fi
        if [ -z "${VIRTUAL_ENV}" ]; then
            to_venv 2>/dev/null
        fi
    }
  #+END_SRC

  - Inspired by [[https://lukesmith.xyz/]]
    #+BEGIN_SRC sh :tangle ../env/shrc
      # Navigate using 'lf' and cd to location
      lfcd () {
          if ! command -v 'lf' >/dev/null 2>/dev/null; then
              printf "lf is not installed\n"
              return 127
          fi
          tmp_file="$(mktemp)"
          lf -last-dir-path="${tmp_file}" "$@"
          if [ -f "${tmp_file}" ]; then
              target_dir="$(cat "${tmp_file}")"
              rm -f "${tmp_file}" >/dev/null
              if [ -d "${target_dir}" ] && [ "${target_dir}" != "$(pwd)" ]; then
                  cd "${target_dir}" || return
              fi
          fi
          unset tmp_file target_dir
      }

      # Navigate using pattern 'fzf' and cd to location
      fzfcd () {
          if ! command -v 'fzf' >/dev/null 2>/dev/null; then
              printf "fzf is not installed\n"
              return 127
          fi
          cd "$(dirname "$(fzf)")" || true
      }
    #+END_SRC

** zwc
- Guess whether target is zipped;
  if zipped, unzip and count else classical wc
  #+begin_src sh :tangle ../env/shrc
    # gunzip, word count
    zwc () {
        args="$*"
        fname="${args##* }"
        args="${args% ${fname}}"
        args="${args%${fname}}"

        if gzip -t "${fname}" > /dev/null 2>&1; then
            if [ -z "${args}" ]; then
                zcat -f "${fname}" | wc
            else
                # shellcheck disable=SC2086
                zcat -f "${fname}" | wc $args
            fi
            return
        else
            wc "$@"
            return
        fi

    }
  #+end_src

** disable auto-venv
- To disable auto-switching virtualenv, hard-set VIRTUAL_ENV
  - Calling the function again reverts
    #+BEGIN_SRC sh :tangle ../env/shrc
      # When we wish NOT to use first encountered venv (default behaviour)
      # we use this function. (function behaviour: toggle)
      force_global_venv () {
          if [ "${VIRTUAL_ENV}" = "Global_Env" ]; then
              unset VIRTUAL_ENV
              to_venv 2>/dev/null
          else
              deactivate 2>/dev/null
              VIRTUAL_ENV="Global_Env"
          fi
      }
    #+END_SRC

