docs/index.html

<div id="outline-container-org0749203" class="outline-3">
<h3 id="org0749203">Launch GUI</h3>
<div class="outline-text-3" id="text-org0749203">
<p>
Launch application and exit terminal window
Acts like a launcher
Un-interactive terminal commands may also be called
Code is tangled in gui.org
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">Launch command and kill current shell if command exists</span>
<span class="org-function-name">gui</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-string">"${RUNCOM:-${HOME}/.runcom}/bin/gui.sh"</span> <span class="org-string">"$*"</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> $<span class="org-variable-name">?</span> = 65 <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-comment-delimiter"># </span><span class="org-comment">if bin/gui.sh returns 65, kill shell, else, maintain</span>
        <span class="org-keyword">exit</span> 0
    <span class="org-keyword">fi</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9806d80" class="outline-3">
<h3 id="org9806d80">Un-Compress by context</h3>
<div class="outline-text-3" id="text-org9806d80">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">uncompress using appropriate protocol (guessed from extension)</span>
<span class="org-function-name">deconvolute</span><span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-keyword">if </span><span class="org-builtin">builtin</span> command -v <span class="org-string">"pigz"</span> &gt;/dev/null 2&gt;&amp;1; <span class="org-keyword">then</span>
        <span class="org-variable-name">_gzip</span>=<span class="org-string">"pigz"</span>
    <span class="org-keyword">else</span>
        <span class="org-variable-name">_gzip</span>=<span class="org-string">'gzip'</span>
    <span class="org-keyword">fi</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-negation-char">!</span> -f <span class="org-string">"${1}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-builtin">echo</span> <span class="org-string">"${1}: no such file"</span>;
    <span class="org-keyword">else</span>
        <span class="org-keyword">case</span> <span class="org-string">"${1}"</span><span class="org-keyword"> in</span>
            *.tar.bz2) tar -xjf <span class="org-string">"${1}"</span> ;;
            *.tbz2) tar -xjf <span class="org-string">"${1}"</span> ;;
            *.tar.gz) tar -x --use-compress-program=<span class="org-string">"${_gzip}"</span> -f <span class="org-string">"${1}"</span> ;;
            *.tgz) tar -x --use-compress-program=<span class="org-string">"${_gzip}"</span> -f <span class="org-string">"${1}"</span> ;;
            *.gz) unpigz <span class="org-string">"${1}"</span> || gunzip <span class="org-string">"${1}"</span> ;;
            *.rar) unrar -x <span class="org-string">"${1}"</span> ;;
            *.tar) tar -xf <span class="org-string">"${1}"</span> ;;
            *.zip) unzip <span class="org-string">"${1}"</span> ;;
            *.tar.xz) tar -xf <span class="org-string">"${1}"</span> ;;
            *) <span class="org-builtin">echo</span> <span class="org-string">"Cannot extract ${1}, provide explicit command"</span>;;
        <span class="org-keyword">esac</span>
    <span class="org-keyword">fi</span>
    <span class="org-builtin">unset</span> _gzip
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org93ab6ea" class="outline-3">
<h3 id="org93ab6ea">Navigate</h3>
<div class="outline-text-3" id="text-org93ab6ea">
<ul class="org-ul">
<li><p>
When no virtualenv is active, but one is available, switch to it
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="org-builtin">cd</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -z <span class="org-string">"${1}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-builtin">builtin</span> cd <span class="org-string">"${HOME}"</span> || <span class="org-builtin">true</span>
    <span class="org-keyword">else</span>
        <span class="org-builtin">builtin</span> cd <span class="org-string">"${1}"</span>  || <span class="org-builtin">true</span>
    <span class="org-keyword">fi</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -z <span class="org-string">"${VIRTUAL_ENV}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        to_venv 2&gt;/dev/null
    <span class="org-keyword">fi</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<ul class="org-ul">
<li><p>
Inspired by <a href="https://lukesmith.xyz/">https://lukesmith.xyz/</a>
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">Navigate using 'lf' and cd to location</span>
<span class="org-function-name">lfcd</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-keyword">if</span> <span class="org-negation-char">!</span> command -v <span class="org-string">'lf'</span> &gt;/dev/null 2&gt;/dev/null; <span class="org-keyword">then</span>
        printf <span class="org-string">"lf is not installed\n"</span>
        <span class="org-keyword">return</span> 127
    <span class="org-keyword">fi</span>
    <span class="org-variable-name">tmp_file</span>=<span class="org-string">"$(mktemp)"</span>
    lf -last-dir-path=<span class="org-string">"${tmp_file}"</span> <span class="org-string">"$@"</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -f <span class="org-string">"${tmp_file}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-variable-name">target_dir</span>=<span class="org-string">"$(cat "${tmp_file}")"</span>
        rm -f <span class="org-string">"${tmp_file}"</span> &gt;/dev/null
        <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -d <span class="org-string">"${target_dir}"</span> <span class="org-rainbow-delimiters-depth-2">]</span> &amp;&amp; <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-string">"${target_dir}"</span> != <span class="org-string">"$(pwd)"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
            <span class="org-builtin">cd</span> <span class="org-string">"${target_dir}"</span> || <span class="org-keyword">return</span>
        <span class="org-keyword">fi</span>
    <span class="org-keyword">fi</span>
    <span class="org-builtin">unset</span> tmp_file target_dir
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Navigate using pattern 'fzf' and cd to location</span>
<span class="org-function-name">fzfcd</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-keyword">if</span> <span class="org-negation-char">!</span> command -v <span class="org-string">'fzf'</span> &gt;/dev/null 2&gt;/dev/null; <span class="org-keyword">then</span>
        printf <span class="org-string">"fzf is not installed\n"</span>
        <span class="org-keyword">return</span> 127
    <span class="org-keyword">fi</span>
    <span class="org-builtin">cd</span> <span class="org-string">"$(dirname "$(fzf)")"</span> || <span class="org-builtin">true</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgb61ed4d" class="outline-3">
<h3 id="orgb61ed4d">zwc</h3>
<div class="outline-text-3" id="text-orgb61ed4d">
<ul class="org-ul">
<li><p>
Guess whether target is zipped;
if zipped, unzip and count else classical wc
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">gunzip, word count</span>
<span class="org-function-name">zwc</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-variable-name">args</span>=<span class="org-string">"$*"</span>
    <span class="org-variable-name">fname</span>=<span class="org-string">"${args##* }"</span>
    <span class="org-variable-name">args</span>=<span class="org-string">"${args% ${fname}}"</span>
    <span class="org-variable-name">args</span>=<span class="org-string">"${args%${fname}}"</span>

    <span class="org-keyword">if</span> gzip -t <span class="org-string">"${fname}"</span> &gt; /dev/null 2&gt;&amp;1; <span class="org-keyword">then</span>
        <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -z <span class="org-string">"${args}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
            zcat -f <span class="org-string">"${fname}"</span> | wc
        <span class="org-keyword">else</span>
            <span class="org-comment-delimiter"># </span><span class="org-comment">shellcheck disable=SC2086</span>
            zcat -f <span class="org-string">"${fname}"</span> | wc $<span class="org-variable-name">args</span>
        <span class="org-keyword">fi</span>
        <span class="org-keyword">return</span>
    <span class="org-keyword">else</span>
        wc <span class="org-string">"$@"</span>
        <span class="org-keyword">return</span>
    <span class="org-keyword">fi</span>

<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-org139c4d9" class="outline-3">
<h3 id="org139c4d9">disable auto-venv</h3>
<div class="outline-text-3" id="text-org139c4d9">
<ul class="org-ul">
<li>To disable auto-switching virtualenv, hard-set VIRTUAL_ENV
<ul class="org-ul">
<li><p>
Calling the function again reverts
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">When we wish NOT to use first encountered venv (default behaviour)</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">we use this function. (function behaviour: toggle)</span>
<span class="org-function-name">force_global_venv</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-string">"${VIRTUAL_ENV}"</span> = <span class="org-string">"Global_Env"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-builtin">unset</span> VIRTUAL_ENV
        to_venv 2&gt;/dev/null
    <span class="org-keyword">else</span>
        deactivate 2&gt;/dev/null
        <span class="org-variable-name">VIRTUAL_ENV</span>=<span class="org-string">"Global_Env"</span>
    <span class="org-keyword">fi</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div></li>
</ul></li>
</ul>
</div>
</div>
