org/index.org
** lszcat
#+begin_src sh :tangle ../env/shrc
  # gunzip and ls (if directory) or cat (if file)
  lszcat () {
      args="$*"
      fname="${args##* }"
      args="${args%% ${fname}}"
      args="${args%%${fname}}"

      if builtin command -v bat >/dev/null 2>&1; then
          betcat="$(which bat)"
      else
          betcat="$(which cat)"
      fi

      if builtin command -v exa >/dev/null 2>&1; then
          betls="$(which exa)"
      else
          betls="$(which ls)"
      fi

      if [ -z "${fname}" ] || [ ! "${fname#-}" = "${fname}" ]; then
          if [ -z "${args}" ]; then
              args="${fname}"
          else
              args="${args} ${fname}"
          fi
          fname="$(readlink -f ".")"
          echo "${fname}"
      fi

      if [ -d "${fname}" ]; then
          # shellcheck disable=SC2086
          "${betls}" ${args} "${fname}"
      elif gzip -t "${fname}" >/dev/null 2>&1; then
          # shellcheck disable=SC2086
          zcat -f ${args} "${fname}" | "${betcat}"
      else
          # shellcheck disable=SC2086
          "${betcat}" ${args} "${fname}"
      fi
  }
#+end_src

** Manual pages
#+BEGIN_SRC sh :tangle ../env/shrc
  # if manpage is available, display. else display tldr if it is available
  # else, assume '--help' argument and display output passing --help to command
  _rc_man_help () {
      if man "$@"; then
          return 0
      elif tldr "$@"; then
          return 0
      elif builtin command -v "$1" >/dev/null 2>/dev/null; then
          printf "trying to display %s --help output\n" "${1}"
          if builtin command -v 'bat' >/dev/null 2>/dev/null; then
              $1 --help 2>&1 | bat
          else
              $1 --help 2>&1 | less -RF
          fi
          return 0
      else
          return 16
      fi
  }
#+END_SRC

** Selection menu
*** Pure POSIX
#+BEGIN_SRC sh :tangle ../env/shrc
  # posix selection option by index in cli
  _rc_posix_select () {
      # select implementation for POSIX
      heading="${1}"
      shift
      len_head="$(expr length "${heading}")"
      printf "\n--"
      for _ in {1.."${len_head}"}; do printf "-"; done
      printf "--\n"

      printf "| %s |: [%s]" "${heading}" "${1}"

      printf "\n--"
      for _ in {1.."${len_head}"}; do printf "-"; done
      printf "--\n"
      unset len_head
      word_l=""
      count=0
      for word in $@; do
          if [ -z "${word_l}" ]; then
              word_l="${word}"
          else
              word_l="${word_l} ${word}"
          fi
          count=$((count + 1))
          echo "${count}: ${word}" >&2
      done
      printf "Selection: " >&2
      read -r s_num
      echo "${word_l}" | cut -d' ' -f"${s_num}" 2>/dev/null
      unset word word_l count
  }
#+END_SRC

