docs/index.html

<div id="outline-container-orgca09949" class="outline-3">
<h3 id="orgca09949">lszcat</h3>
<div class="outline-text-3" id="text-orgca09949">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">gunzip and ls (if directory) or cat (if file)</span>
<span class="org-function-name">lszcat</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-variable-name">args</span>=<span class="org-string">"$*"</span>
    <span class="org-variable-name">fname</span>=<span class="org-string">"${args##* }"</span>
    <span class="org-variable-name">args</span>=<span class="org-string">"${args%% ${fname}}"</span>
    <span class="org-variable-name">args</span>=<span class="org-string">"${args%%${fname}}"</span>

    <span class="org-keyword">if </span><span class="org-builtin">builtin</span> command -v bat &gt;/dev/null 2&gt;&amp;1; <span class="org-keyword">then</span>
        <span class="org-variable-name">betcat</span>=<span class="org-string">"$(which bat)"</span>
    <span class="org-keyword">else</span>
        <span class="org-variable-name">betcat</span>=<span class="org-string">"$(which cat)"</span>
    <span class="org-keyword">fi</span>

    <span class="org-keyword">if </span><span class="org-builtin">builtin</span> command -v exa &gt;/dev/null 2&gt;&amp;1; <span class="org-keyword">then</span>
        <span class="org-variable-name">betls</span>=<span class="org-string">"$(which exa)"</span>
    <span class="org-keyword">else</span>
        <span class="org-variable-name">betls</span>=<span class="org-string">"$(which ls)"</span>
    <span class="org-keyword">fi</span>

    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -z <span class="org-string">"${fname}"</span> <span class="org-rainbow-delimiters-depth-2">]</span> || <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-negation-char">!</span> <span class="org-string">"${fname#-}"</span> = <span class="org-string">"${fname}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -z <span class="org-string">"${args}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
            <span class="org-variable-name">args</span>=<span class="org-string">"${fname}"</span>
        <span class="org-keyword">else</span>
            <span class="org-variable-name">args</span>=<span class="org-string">"${args} ${fname}"</span>
        <span class="org-keyword">fi</span>
        <span class="org-variable-name">fname</span>=<span class="org-string">"$(readlink -f ".")"</span>
        <span class="org-builtin">echo</span> <span class="org-string">"${fname}"</span>
    <span class="org-keyword">fi</span>

    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -d <span class="org-string">"${fname}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-comment-delimiter"># </span><span class="org-comment">shellcheck disable=SC2086</span>
        <span class="org-string">"${betls}"</span> $<span class="org-rainbow-delimiters-depth-2">{</span><span class="org-variable-name">args</span><span class="org-rainbow-delimiters-depth-2">}</span> <span class="org-string">"${fname}"</span>
    <span class="org-keyword">elif</span> gzip -t <span class="org-string">"${fname}"</span> &gt;/dev/null 2&gt;&amp;1; <span class="org-keyword">then</span>
        <span class="org-comment-delimiter"># </span><span class="org-comment">shellcheck disable=SC2086</span>
        zcat -f $<span class="org-rainbow-delimiters-depth-2">{</span><span class="org-variable-name">args</span><span class="org-rainbow-delimiters-depth-2">}</span> <span class="org-string">"${fname}"</span> | <span class="org-string">"${betcat}"</span>
    <span class="org-keyword">else</span>
        <span class="org-comment-delimiter"># </span><span class="org-comment">shellcheck disable=SC2086</span>
        <span class="org-string">"${betcat}"</span> $<span class="org-rainbow-delimiters-depth-2">{</span><span class="org-variable-name">args</span><span class="org-rainbow-delimiters-depth-2">}</span> <span class="org-string">"${fname}"</span>
    <span class="org-keyword">fi</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgad2eb9f" class="outline-3">
<h3 id="orgad2eb9f">Manual pages</h3>
<div class="outline-text-3" id="text-orgad2eb9f">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">if manpage is available, display. else display tldr if it is available</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">else, assume '--help' argument and display output passing --help to command</span>
<span class="org-function-name">_rc_man_help</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-keyword">if</span> man <span class="org-string">"$@"</span>; <span class="org-keyword">then</span>
        <span class="org-keyword">return</span> 0
    <span class="org-keyword">elif</span> tldr <span class="org-string">"$@"</span>; <span class="org-keyword">then</span>
        <span class="org-keyword">return</span> 0
    <span class="org-keyword">elif </span><span class="org-builtin">builtin</span> command -v <span class="org-string">"$1"</span> &gt;/dev/null 2&gt;/dev/null; <span class="org-keyword">then</span>
        printf <span class="org-string">"trying to display %s --help output\n"</span> <span class="org-string">"${1}"</span>
        <span class="org-keyword">if </span><span class="org-builtin">builtin</span> command -v <span class="org-string">'bat'</span> &gt;/dev/null 2&gt;/dev/null; <span class="org-keyword">then</span>
            $<span class="org-variable-name">1</span> --help 2&gt;&amp;1 | bat
        <span class="org-keyword">else</span>
            $<span class="org-variable-name">1</span> --help 2&gt;&amp;1 | less -RF
        <span class="org-keyword">fi</span>
        <span class="org-keyword">return</span> 0
    <span class="org-keyword">else</span>
        <span class="org-keyword">return</span> 16
    <span class="org-keyword">fi</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9acaa36" class="outline-3">
<h3 id="org9acaa36">Selection menu</h3>
<div class="outline-text-3" id="text-org9acaa36">
</div>
<div id="outline-container-org50a0e21" class="outline-4">
<h4 id="org50a0e21">Pure POSIX</h4>
<div class="outline-text-4" id="text-org50a0e21">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">posix selection option by index in cli</span>
<span class="org-function-name">_rc_posix_select</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">select implementation for POSIX</span>
    <span class="org-variable-name">heading</span>=<span class="org-string">"${1}"</span>
    <span class="org-builtin">shift</span>
    <span class="org-variable-name">len_head</span>=<span class="org-string">"$(expr length "${heading}")"</span>
    printf <span class="org-string">"\n--"</span>
    <span class="org-keyword">for</span> _<span class="org-keyword"> in</span> <span class="org-rainbow-delimiters-depth-2">{</span>1..<span class="org-string">"${len_head}"</span><span class="org-rainbow-delimiters-depth-2">}</span>; <span class="org-keyword">do</span> printf <span class="org-string">"-"</span>; <span class="org-keyword">done</span>
    printf <span class="org-string">"--\n"</span>

    printf <span class="org-string">"| %s |: [%s]"</span> <span class="org-string">"${heading}"</span> <span class="org-string">"${1}"</span>

    printf <span class="org-string">"\n--"</span>
    <span class="org-keyword">for</span> _<span class="org-keyword"> in</span> <span class="org-rainbow-delimiters-depth-2">{</span>1..<span class="org-string">"${len_head}"</span><span class="org-rainbow-delimiters-depth-2">}</span>; <span class="org-keyword">do</span> printf <span class="org-string">"-"</span>; <span class="org-keyword">done</span>
    printf <span class="org-string">"--\n"</span>
    <span class="org-builtin">unset</span> len_head
    <span class="org-variable-name">word_l</span>=<span class="org-string">""</span>
    <span class="org-variable-name">count</span>=0
    <span class="org-keyword">for</span> word<span class="org-keyword"> in</span> $<span class="org-variable-name">@</span>; <span class="org-keyword">do</span>
        <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -z <span class="org-string">"${word_l}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
            <span class="org-variable-name">word_l</span>=<span class="org-string">"${word}"</span>
        <span class="org-keyword">else</span>
            <span class="org-variable-name">word_l</span>=<span class="org-string">"${word_l} ${word}"</span>
        <span class="org-keyword">fi</span>
        <span class="org-variable-name">count</span>=$<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">(</span>count + 1<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
        <span class="org-builtin">echo</span> <span class="org-string">"${count}: ${word}"</span> &gt;&amp;2
    <span class="org-keyword">done</span>
    printf <span class="org-string">"Selection: "</span> &gt;&amp;2
    <span class="org-builtin">read</span> -r s_num
    <span class="org-builtin">echo</span> <span class="org-string">"${word_l}"</span> | cut -d<span class="org-string">' '</span> -f<span class="org-string">"${s_num}"</span> 2&gt;/dev/null
    <span class="org-builtin">unset</span> word word_l count
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>
