org/index.org
*** NCURSES Dialog
TODO: better temporary declaration of =DIALOGRC=
#+BEGIN_SRC sh :tangle ../env/shrc
  _rc_dialog_select () {
      heading="${1}"
      shift
      opt_list=
      opt_num=0
      while [ $# -gt 0 ]; do
          opt_num=$(( opt_num + 1 ))
          opt_list="${opt_list} $opt_num ${1}"
          shift
      done
      export DIALOGRC="${RUNCOMDIR}/env/dialogrc"
      s_num="$(echo "${opt_list}" \
                    | xargs dialog --stdout \
                    --menu "${heading}" 0 0 0 2>/dev/null)"
      export DIALOGRC=
      echo "$opt_list" | cut -d " " -f $((s_num + s_num + 1))
      unset opt_list opt_num s_num
  }
#+END_SRC

*** Appropriate
#+BEGIN_SRC sh :tangle ../env/shrc
  _rc_select () {
      if [ "${_RC_SHELL}" = "zsh" ]; then
          mod_opt=false
          now_setopts="$(setopt)"
          if [ "${now_setopts#*shwordsplit}" = "${now_setopts}" ]; then
              setopt shwordsplit
              mod_opt=true
          fi
      fi

      if builtin command -v dialog >/dev/null 2>&1; then
          _selected="$(_rc_dialog_select $@)"
      else
          _selected="$(_rc_posix_select $@)"
      fi

      if [ "${_RC_SHELL}" = "zsh" ] && $mod_opt; then
          unsetopt shwordsplit
      fi

      if [ -z "${_selected}" ]; then
          _selected="$(echo $@ | cut -d" " -f1)"
      fi
      echo "${_selected}"
      unset mod_opt now_setopts _selected
  }
#+END_SRC

* Aliases
** manual page help
#+BEGIN_SRC sh :tangle ../env/shrc
  alias man="_rc_man_help";
#+END_SRC
** Network
#+BEGIN_SRC sh :tangle ../env/shrc
  alias nload='nload -u M -U G -t 10000 -a 3600 $(ip a | grep -m 1 " UP " | cut -d " " -f 2 | cut -d ":" -f 1)'
  alias nethogs='sudo su -l -c "nethogs $(ip a | grep  "state UP" | cut -d " " -f 2 | cut -d ":" -f 1) -d 10"';
  alias ping="ping -c 4 ";
#+END_SRC

** Monitor Job queues
#+BEGIN_SRC sh :tangle ../env/shrc
  alias watch="watch -n 10 --color";
#+END_SRC

** Lazy single-handed exit
#+BEGIN_SRC sh :tangle ../env/shrc
  alias qqqq="exit";
#+END_SRC

** [z]wc
#+begin_src sh :tangle ../env/shrc
  alias wc="zwc";
#+end_src

** Encrypted cURL
- With look for =${HOME}/.netrc.gpg=.
  If it exists, decrypt it and use the contents.
#+begin_src sh :tangle ../env/shrc
  # does nothing
  _rc_decrypt_netrc () {
      true
  }
  alias curl="curl --netrc-file <( gpg --batch -q -d ~/.netrc.gpg )"
#+end_src
* Networking
** State
#+BEGIN_SRC sh :tangle ../env/shrc
  "${RUNCOMDIR}/bin/timeout.sh"
#+END_SRC

** SSH Agent
Reuse ssh agent for all logins
#+BEGIN_SRC sh :tangle ../env/ui
  if [ ! -S "${HOME}/.ssh/ssh_auth_sock" ]; then
      eval "$(ssh-agent)"
      ln -sf "$SSH_AUTH_SOCK" ~/.ssh/ssh_auth_sock
  fi
  SSH_AUTH_SOCK=~/.ssh/ssh_auth_sock
  export SSH_AUTH_SOCK
  ssh-add -l > /dev/null || ssh-add
#+END_SRC

* Window Manager settings
** Terminal
#+BEGIN_SRC sh :tangle ../env/ui
  for term in alacritty foot termite tilix urxvt xterm; do
      if [ -n "$(command -v $term)" ]; then
          defterm="$term";
          export defterm
          break;
      fi;
  done
#+END_SRC

** Sway exports
Don't really remember why these were made
Not using currently. Preserved for future
tangle to bash_login
export WLR_BACKENDS="headless";
export WLR_LIBINPUT_NO_DEVICES=1;

** User Interface (GUI/CLI)
If running from tty1 offer to launch a graphical session
