docs/index.html

<div id="outline-container-org22bce10" class="outline-4">
<h4 id="org22bce10">NCURSES Dialog</h4>
<div class="outline-text-4" id="text-org22bce10">
<p>
TODO: better temporary declaration of <code>DIALOGRC</code>
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="org-function-name">_rc_dialog_select</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-variable-name">heading</span>=<span class="org-string">"${1}"</span>
    <span class="org-builtin">shift</span>
    <span class="org-variable-name">opt_list</span>=
    <span class="org-variable-name">opt_num</span>=0
    <span class="org-keyword">while</span> <span class="org-rainbow-delimiters-depth-2">[</span> $<span class="org-variable-name">#</span> -gt 0 <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">do</span>
        <span class="org-variable-name">opt_num</span>=$<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">(</span> opt_num + 1 <span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
        <span class="org-variable-name">opt_list</span>=<span class="org-string">"${opt_list} $opt_num ${1}"</span>
        <span class="org-builtin">shift</span>
    <span class="org-keyword">done</span>
    <span class="org-builtin">export</span> <span class="org-variable-name">DIALOGRC</span>=<span class="org-string">"${RUNCOMDIR}/env/dialogrc"</span>
    <span class="org-variable-name">s_num</span>=<span class="org-string">"$(echo "${opt_list}" \</span>
<span class="org-string">                  | xargs dialog --stdout \</span>
<span class="org-string">                  --menu "${heading}" 0 0 0 2&gt;/dev/null)"</span>
    <span class="org-builtin">export</span> <span class="org-variable-name">DIALOGRC</span>=
    <span class="org-builtin">echo</span> <span class="org-string">"$opt_list"</span> | cut -d <span class="org-string">" "</span> -f $<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">(</span>s_num + s_num + 1<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
    <span class="org-builtin">unset</span> opt_list opt_num s_num
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf8875d2" class="outline-4">
<h4 id="orgf8875d2">Appropriate</h4>
<div class="outline-text-4" id="text-orgf8875d2">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-function-name">_rc_select</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-string">"${_RC_SHELL}"</span> = <span class="org-string">"zsh"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-variable-name">mod_opt</span>=false
        <span class="org-variable-name">now_setopts</span>=<span class="org-string">"$(setopt)"</span>
        <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-string">"${now_setopts#*shwordsplit}"</span> = <span class="org-string">"${now_setopts}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
            <span class="org-builtin">setopt</span> shwordsplit
            <span class="org-variable-name">mod_opt</span>=true
        <span class="org-keyword">fi</span>
    <span class="org-keyword">fi</span>

    <span class="org-keyword">if </span><span class="org-builtin">builtin</span> command -v dialog &gt;/dev/null 2&gt;&amp;1; <span class="org-keyword">then</span>
        <span class="org-variable-name">_selected</span>=<span class="org-string">"$(_rc_dialog_select $@)"</span>
    <span class="org-keyword">else</span>
        <span class="org-variable-name">_selected</span>=<span class="org-string">"$(_rc_posix_select $@)"</span>
    <span class="org-keyword">fi</span>

    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-string">"${_RC_SHELL}"</span> = <span class="org-string">"zsh"</span> <span class="org-rainbow-delimiters-depth-2">]</span> &amp;&amp; $<span class="org-variable-name">mod_opt</span>; <span class="org-keyword">then</span>
        <span class="org-builtin">unsetopt</span> shwordsplit
    <span class="org-keyword">fi</span>

    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -z <span class="org-string">"${_selected}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-variable-name">_selected</span>=<span class="org-string">"$(echo $@ | cut -d" " -f1)"</span>
    <span class="org-keyword">fi</span>
    <span class="org-builtin">echo</span> <span class="org-string">"${_selected}"</span>
    <span class="org-builtin">unset</span> mod_opt now_setopts _selected
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org0e4df57" class="outline-2">
<h2 id="org0e4df57">Aliases</h2>
<div class="outline-text-2" id="text-org0e4df57">
</div>
<div id="outline-container-orga759f52" class="outline-3">
<h3 id="orga759f52">manual page help</h3>
<div class="outline-text-3" id="text-orga759f52">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-builtin">alias</span> <span class="org-variable-name">man</span>=<span class="org-string">"_rc_man_help"</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-org4fbce1b" class="outline-3">
<h3 id="org4fbce1b">Network</h3>
<div class="outline-text-3" id="text-org4fbce1b">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-builtin">alias</span> <span class="org-variable-name">nload</span>=<span class="org-string">'nload -u M -U G -t 10000 -a 3600 $(ip a | grep -m 1 " UP " | cut -d " " -f 2 | cut -d ":" -f 1)'</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">nethogs</span>=<span class="org-string">'sudo su -l -c "nethogs $(ip a | grep  "state UP" | cut -d " " -f 2 | cut -d ":" -f 1) -d 10"'</span>;
<span class="org-builtin">alias</span> <span class="org-variable-name">ping</span>=<span class="org-string">"ping -c 4 "</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-org783aa21" class="outline-3">
<h3 id="org783aa21">Monitor Job queues</h3>
<div class="outline-text-3" id="text-org783aa21">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-builtin">alias</span> <span class="org-variable-name">watch</span>=<span class="org-string">"watch -n 10 --color"</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-org16650f3" class="outline-3">
<h3 id="org16650f3">Lazy single-handed exit</h3>
<div class="outline-text-3" id="text-org16650f3">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-builtin">alias</span> <span class="org-variable-name">qqqq</span>=<span class="org-string">"exit"</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf141917" class="outline-3">
<h3 id="orgf141917">[z]wc</h3>
<div class="outline-text-3" id="text-orgf141917">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-builtin">alias</span> <span class="org-variable-name">wc</span>=<span class="org-string">"zwc"</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-org062e1ad" class="outline-3">
<h3 id="org062e1ad">Encrypted cURL</h3>
<div class="outline-text-3" id="text-org062e1ad">
<ul class="org-ul">
<li>With look for <code>${HOME}/.netrc.gpg</code>.
If it exists, decrypt it and use the contents.</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">does nothing</span>
<span class="org-function-name">_rc_decrypt_netrc</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-builtin">true</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">curl</span>=<span class="org-string">"curl --netrc-file &lt;( gpg --batch -q -d ~/.netrc.gpg )"</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org77fb127" class="outline-2">
<h2 id="org77fb127">Networking</h2>
<div class="outline-text-2" id="text-org77fb127">
</div>
<div id="outline-container-orgb8242bf" class="outline-3">
<h3 id="orgb8242bf">State</h3>
<div class="outline-text-3" id="text-orgb8242bf">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-string">"${RUNCOMDIR}/bin/timeout.sh"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org65c887e" class="outline-3">
<h3 id="org65c887e">SSH Agent</h3>
<div class="outline-text-3" id="text-org65c887e">
<p>
Reuse ssh agent for all logins
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-1">[</span> <span class="org-negation-char">!</span> -S <span class="org-string">"${HOME}/.ssh/ssh_auth_sock"</span> <span class="org-rainbow-delimiters-depth-1">]</span>; <span class="org-keyword">then</span>
    <span class="org-builtin">eval</span> <span class="org-string">"$(ssh-agent)"</span>
    ln -sf <span class="org-string">"$SSH_AUTH_SOCK"</span> ~/.ssh/ssh_auth_sock
<span class="org-keyword">fi</span>
<span class="org-variable-name">SSH_AUTH_SOCK</span>=~/.ssh/ssh_auth_sock
<span class="org-builtin">export</span> SSH_AUTH_SOCK
ssh-add -l &gt; /dev/null || ssh-add
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org7fe7af3" class="outline-2">
<h2 id="org7fe7af3">Window Manager settings</h2>
<div class="outline-text-2" id="text-org7fe7af3">
</div>
<div id="outline-container-orge98954c" class="outline-3">
<h3 id="orge98954c">Terminal</h3>
<div class="outline-text-3" id="text-orge98954c">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-keyword">for</span> term<span class="org-keyword"> in</span> alacritty foot termite tilix urxvt xterm; <span class="org-keyword">do</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-1">[</span> -n <span class="org-string">"$(command -v $term)"</span> <span class="org-rainbow-delimiters-depth-1">]</span>; <span class="org-keyword">then</span>
        <span class="org-variable-name">defterm</span>=<span class="org-string">"$term"</span>;
        <span class="org-builtin">export</span> defterm
        <span class="org-keyword">break</span>;
    <span class="org-keyword">fi</span>;
<span class="org-keyword">done</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org289ce2d" class="outline-3">
<h3 id="org289ce2d">Sway exports</h3>
<div class="outline-text-3" id="text-org289ce2d">
<p>
Don&rsquo;t really remember why these were made
Not using currently. Preserved for future
tangle to bash_login
export WLR_BACKENDS=&ldquo;headless&rdquo;;
export WLR_LIBINPUT_NO_DEVICES=1;
</p>
</div>
</div>

<div id="outline-container-org34decd6" class="outline-3">
<h3 id="org34decd6">User Interface (GUI/CLI)</h3>
<div class="outline-text-3" id="text-org34decd6">
<p>
If running from tty1 offer to launch a graphical session
</p>
</div>
