org/index.org
*** Graphical exports preparations
Exports to be made according to selected graphical environment
#+BEGIN_SRC sh :tangle ../env/ui
  # exports common to both wayland and X11
  _rc_common_exports() {
      if [ -z "$XDG_RUNTIME_DIR" ]; then
          XDG_RUNTIME_DIR="/run/user/$(id -u)"
      fi
      QT_PLUGIN_PATH="/usr/lib/kde4/plugins/"
      QT_AUTO_SCREEN_SCALE_FACTOR=0
      QT_QPA_PLATFORMTHEME="qt5ct"
      _JAVA_AWT_WM_NONREPARENTING=1

      export XDG_RUNTIME_DIR
      export QT_PLUGIN_PATH
      export QT_AUTO_SCREEN_SCALE_FACTOR
      export QT_QPA_PLATFORMTHEME
      export _JAVA_AWT_WM_NONREPARENTING
  }

  # exports specific to wayland
  _rc_exports_for_wayland () {
      # export DISPLAY=":0"
      # export WAYLAND_DISPLAY=wayland-0
      # export GDK_BACKEND=wayland,x11
      _rc_common_exports

      XDG_SESSION_TYPE="wayland"
      SDL_VIDEODRIVER="wayland"
      ECORE_EVAS_ENGINE="wayland_egl"
      ELM_DISPLAY="wl"
      ELM_ENGINE="wayland_egl"
      ELM_ACCEL="opengl"
      QT_QPA_PLATFORM="wayland-egl;xcb"
      QT_WAYLAND_FORCE_DPI=100
      QT_WAYLAND_DISABLE_WINDOWDECORATION=1
      MOZ_ENABLE_WAYLAND=1
      SWAYROOT="${XDG_CONFIG_HOME:-${HOME}/.config}/sway"

      export XDG_SESSION_TYPE
      export SDL_VIDEODRIVER
      export ECORE_EVAS_ENGINE
      export ELM_DISPLAY
      export ELM_ENGINE
      export ELM_ACCEL
      export QT_QPA_PLATFORM
      export QT_WAYLAND_FORCE_DPI
      export QT_WAYLAND_DISABLE_WINDOWDECORATION
      export MOZ_ENABLE_WAYLAND
      export SWAYROOT
  }

  # exports specific to x11
  _rc_exports_for_x11 () {
      _rc_common_exports

      XDG_SESSION_TYPE="x11"
      SDL_VIDEODRIVER="x11"
      I3ROOT="${XDG_CONFIG_HOME:-${HOME}/.config}/i3"

      export XDG_SESSION_TYPE
      export SDL_VIDEODRIVER
      export I3ROOT

      unset ECORE_EVAS_ENGINE
      unset ELM_DISPLAY
      unset ELM_ENGINE
      unset ELM_ACCEL
      unset QT_QPA_PLATFORM
      unset QT_WAYLAND_FORCE_DPI
      unset QT_WAYLAND_DISABLE_WINDOWDECORATION
      unset MOZ_ENABLE_WAYLAND
  }

  # yes/no prompt using dialog
  # Args:
  #    $1: Title
  #    $2: Prompt
  #
  # Returns: "yes" or "no"
  _rc_dialog_yesno () {
      if DIALOGRC="${RUNCOMDIR}/env/dialogrc" dialog \
                 --clear --defaultno --stdout --title "${1}" \
                 --yesno "${2}" 0 0 >/dev/null 2>&1; then
          printf "yes\n"
      else
          printf "no\n"
      fi
  }

  # offer to export proxies to global environment before launching GUI
  _rc_exports_for_proxies () {
      if [ -z "${export_proxies}" ]; then
          if builtin command -v dialog >/dev/null 2>&1; then
              export_proxies="$(_rc_dialog_yesno "Proxies" "Use proxies?")"
          else
              printf "\n|-------|\n"
              printf "|Proxies|\n"
              printf "|-------|\n"
              printf "Use proxies?[y/N]:\t"
              read -r export_proxies
          fi
      fi
      case "${export_proxies}" in
          [Yy]*)
              all_proxy="$("${RUNCOMDIR:-${HOME}/.runcom}"/bin/proxy_extract.sh)"
              http_proxy="${all_proxy}"
              https_proxy="${all_proxy}"
              ftp_proxy="${all_proxy}"
              ftps_proxy="${all_proxy}"

              export all_proxy
              export http_proxy
              export https_proxy
              export ftp_proxy
              export ftps_proxy
              ;;
          ,*)
              ;;
      esac

  }
#+END_SRC

