docs/index.html
<div id="outline-container-org86c696e" class="outline-4">
<h4 id="org86c696e">Graphical exports preparations</h4>
<div class="outline-text-4" id="text-org86c696e">
<p>
Exports to be made according to selected graphical environment
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">exports common to both wayland and X11</span>
<span class="org-function-name">_rc_common_exports</span><span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -z <span class="org-string">"$XDG_RUNTIME_DIR"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-variable-name">XDG_RUNTIME_DIR</span>=<span class="org-string">"/run/user/$(id -u)"</span>
    <span class="org-keyword">fi</span>
    <span class="org-variable-name">QT_PLUGIN_PATH</span>=<span class="org-string">"/usr/lib/kde4/plugins/"</span>
    <span class="org-variable-name">QT_AUTO_SCREEN_SCALE_FACTOR</span>=0
    <span class="org-variable-name">QT_QPA_PLATFORMTHEME</span>=<span class="org-string">"qt5ct"</span>
    <span class="org-variable-name">_JAVA_AWT_WM_NONREPARENTING</span>=1

    <span class="org-builtin">export</span> XDG_RUNTIME_DIR
    <span class="org-builtin">export</span> QT_PLUGIN_PATH
    <span class="org-builtin">export</span> QT_AUTO_SCREEN_SCALE_FACTOR
    <span class="org-builtin">export</span> QT_QPA_PLATFORMTHEME
    <span class="org-builtin">export</span> _JAVA_AWT_WM_NONREPARENTING
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">exports specific to wayland</span>
<span class="org-function-name">_rc_exports_for_wayland</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">export DISPLAY=":0"</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">export WAYLAND_DISPLAY=wayland-0</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">export GDK_BACKEND=wayland,x11</span>
    _rc_common_exports

    <span class="org-variable-name">XDG_SESSION_TYPE</span>=<span class="org-string">"wayland"</span>
    <span class="org-variable-name">SDL_VIDEODRIVER</span>=<span class="org-string">"wayland"</span>
    <span class="org-variable-name">ECORE_EVAS_ENGINE</span>=<span class="org-string">"wayland_egl"</span>
    <span class="org-variable-name">ELM_DISPLAY</span>=<span class="org-string">"wl"</span>
    <span class="org-variable-name">ELM_ENGINE</span>=<span class="org-string">"wayland_egl"</span>
    <span class="org-variable-name">ELM_ACCEL</span>=<span class="org-string">"opengl"</span>
    <span class="org-variable-name">QT_QPA_PLATFORM</span>=<span class="org-string">"wayland-egl;xcb"</span>
    <span class="org-variable-name">QT_WAYLAND_FORCE_DPI</span>=100
    <span class="org-variable-name">QT_WAYLAND_DISABLE_WINDOWDECORATION</span>=1
    <span class="org-variable-name">MOZ_ENABLE_WAYLAND</span>=1
    <span class="org-variable-name">SWAYROOT</span>=<span class="org-string">"${XDG_CONFIG_HOME:-${HOME}/.config}/sway"</span>

    <span class="org-builtin">export</span> XDG_SESSION_TYPE
    <span class="org-builtin">export</span> SDL_VIDEODRIVER
    <span class="org-builtin">export</span> ECORE_EVAS_ENGINE
    <span class="org-builtin">export</span> ELM_DISPLAY
    <span class="org-builtin">export</span> ELM_ENGINE
    <span class="org-builtin">export</span> ELM_ACCEL
    <span class="org-builtin">export</span> QT_QPA_PLATFORM
    <span class="org-builtin">export</span> QT_WAYLAND_FORCE_DPI
    <span class="org-builtin">export</span> QT_WAYLAND_DISABLE_WINDOWDECORATION
    <span class="org-builtin">export</span> MOZ_ENABLE_WAYLAND
    <span class="org-builtin">export</span> SWAYROOT
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">exports specific to x11</span>
<span class="org-function-name">_rc_exports_for_x11</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    _rc_common_exports

    <span class="org-variable-name">XDG_SESSION_TYPE</span>=<span class="org-string">"x11"</span>
    <span class="org-variable-name">SDL_VIDEODRIVER</span>=<span class="org-string">"x11"</span>
    <span class="org-variable-name">I3ROOT</span>=<span class="org-string">"${XDG_CONFIG_HOME:-${HOME}/.config}/i3"</span>

    <span class="org-builtin">export</span> XDG_SESSION_TYPE
    <span class="org-builtin">export</span> SDL_VIDEODRIVER
    <span class="org-builtin">export</span> I3ROOT

    <span class="org-builtin">unset</span> ECORE_EVAS_ENGINE
    <span class="org-builtin">unset</span> ELM_DISPLAY
    <span class="org-builtin">unset</span> ELM_ENGINE
    <span class="org-builtin">unset</span> ELM_ACCEL
    <span class="org-builtin">unset</span> QT_QPA_PLATFORM
    <span class="org-builtin">unset</span> QT_WAYLAND_FORCE_DPI
    <span class="org-builtin">unset</span> QT_WAYLAND_DISABLE_WINDOWDECORATION
    <span class="org-builtin">unset</span> MOZ_ENABLE_WAYLAND
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">yes/no prompt using dialog</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Args:</span>
<span class="org-comment-delimiter">#    </span><span class="org-comment">$1: Title</span>
<span class="org-comment-delimiter">#    </span><span class="org-comment">$2: Prompt</span>
<span class="org-comment-delimiter">#</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Returns: "yes" or "no"</span>
<span class="org-function-name">_rc_dialog_yesno</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-keyword">if</span> <span class="org-variable-name">DIALOGRC</span>=<span class="org-string">"${RUNCOMDIR}/env/dialogrc"</span> dialog <span class="org-sh-escaped-newline">\</span>
               --clear --defaultno --stdout --title <span class="org-string">"${1}"</span> <span class="org-sh-escaped-newline">\</span>
               --yesno <span class="org-string">"${2}"</span> 0 0 &gt;/dev/null 2&gt;&amp;1; <span class="org-keyword">then</span>
        printf <span class="org-string">"yes\n"</span>
    <span class="org-keyword">else</span>
        printf <span class="org-string">"no\n"</span>
    <span class="org-keyword">fi</span>
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">offer to export proxies to global environment before launching GUI</span>
<span class="org-function-name">_rc_exports_for_proxies</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -z <span class="org-string">"${export_proxies}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-keyword">if </span><span class="org-builtin">builtin</span> command -v dialog &gt;/dev/null 2&gt;&amp;1; <span class="org-keyword">then</span>
            <span class="org-variable-name">export_proxies</span>=<span class="org-string">"$(_rc_dialog_yesno "Proxies" "Use proxies?")"</span>
        <span class="org-keyword">else</span>
            printf <span class="org-string">"\n|-------|\n"</span>
            printf <span class="org-string">"|Proxies|\n"</span>
            printf <span class="org-string">"|-------|\n"</span>
            printf <span class="org-string">"Use proxies?[y/N]:\t"</span>
            <span class="org-builtin">read</span> -r export_proxies
        <span class="org-keyword">fi</span>
    <span class="org-keyword">fi</span>
    <span class="org-keyword">case</span> <span class="org-string">"${export_proxies}"</span><span class="org-keyword"> in</span>
        <span class="org-rainbow-delimiters-depth-2">[</span>Yy<span class="org-rainbow-delimiters-depth-2">]</span>*)
            <span class="org-variable-name">all_proxy</span>=<span class="org-string">"$("${RUNCOMDIR:-${HOME}/.runcom}"/bin/proxy_extract.sh)"</span>
            <span class="org-variable-name">http_proxy</span>=<span class="org-string">"${all_proxy}"</span>
            <span class="org-variable-name">https_proxy</span>=<span class="org-string">"${all_proxy}"</span>
            <span class="org-variable-name">ftp_proxy</span>=<span class="org-string">"${all_proxy}"</span>
            <span class="org-variable-name">ftps_proxy</span>=<span class="org-string">"${all_proxy}"</span>

            <span class="org-builtin">export</span> all_proxy
            <span class="org-builtin">export</span> http_proxy
            <span class="org-builtin">export</span> https_proxy
            <span class="org-builtin">export</span> ftp_proxy
            <span class="org-builtin">export</span> ftps_proxy
            ;;
        *)
            ;;
    <span class="org-keyword">esac</span>

<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>
