org/index.org
*** Graphical selections
Display protocol and session selection
#+BEGIN_SRC sh :tangle ../env/ui
  # clear TTY, recolor
  _rc_clean_up_tty() {
      _rc_common_exports
      if [ "$TERM" = "linux" ]; then
          printf "\e]P0000000" #black
          printf "\e]P83f3f3f" #darkgrey
          printf "\e]P19f3f3f" #darkred
          printf "\e]P9ff9f9f" #red
          printf "\e]P23f9f3f" #darkgreen
          printf "\e]PAbfefbf" #green
          printf "\e]P3bf9f3f" #brown
          printf "\e]PB9fff9f" #yellow
          printf "\e]P45f5f9f" #darkblue
          printf "\e]PC9f9fff" #blue
          printf "\e]P59f3f9f" #darkmagenta
          printf "\e]PDff9fff" #magenta
          printf "\e]P63f9f9f" #darkcyan
          printf "\e]PE9fffff" #cyan
          printf "\e]P7afafaf" #lightgrey
          printf "\e]PFffffff" #white
          clear #for background artifacting
      fi
  }

  # Choice for wayland/X11
  _rc_select_display_protocol () {
      mkdir -p "${XDG_STATE_HOME:-${HOME}/.local/state}/runcom"
      default_proto="$(cat "${XDG_STATE_HOME:-${HOME}/.local/state}/runcom/graph_proto")" 2>/dev/null
      if [ -z "${default_proto}" ]; then
          default_proto="non-graphical"
      fi
      graph_avail="wayland x11 non-graphical"
      graph_avail="${default_proto}${graph_avail#*"${default_proto}"} ${graph_avail%%"${default_proto}"*}"
      graph_proto="$(_rc_select Display-Protocol "${graph_avail}")"
      echo "${graph_proto}" > "${XDG_STATE_HOME:-${HOME}/.local/state}/runcom/graph_proto"
      unset default_proto graph_avail
  }

  # Choice of window manager / desktop environment
  # Args:
  #     $1: protocol name
  _rc_select_proto_session () {
      proto_name="${1}"
      sessions_mem="${XDG_STATE_HOME:-${HOME}/.local/state}/runcom/${proto_name}_session"

      protoinitrc=".xinitrc"
      sessions_dir="/usr/share/xsessions/"
      if [ "${proto_name}" = "wayland" ]; then
          protoinitrc=".wayinitrc"
          sessions_dir="/usr/share/wayland-sessions/"
      fi

      default_session="$(cat "${sessions_mem}")" 2>/dev/null
      if [ -z "${default_session}" ]; then
          default_session="${protoinitrc}"
      fi

      # shellcheck disable=SC2046
      sessions_avail="$(ls "${sessions_dir}")"
      sessions_avail="${default_session}${sessions_avail#*"${default_session}"} ${sessions_avail%%"${default_session}"*}"
      exec_session="$(_rc_select "${proto_name}"-sessions "${sessions_avail}")"
      echo "${exec_session}" > "${sessions_mem}"
      unset default_session sessions_avail
      unset protoinitc
      unset sessions_dir
      unset proto_name
  }
#+END_SRC

