docs/index.html

<div id="outline-container-org30a2c17" class="outline-4">
<h4 id="org30a2c17">Graphical selections</h4>
<div class="outline-text-4" id="text-org30a2c17">
<p>
Display protocol and session selection
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">clear TTY, recolor</span>
<span class="org-function-name">_rc_clean_up_tty</span><span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    _rc_common_exports
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-string">"$TERM"</span> = <span class="org-string">"linux"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        printf <span class="org-string">"\e]P0000000"</span> <span class="org-comment-delimiter">#</span><span class="org-comment">black</span>
        printf <span class="org-string">"\e]P83f3f3f"</span> <span class="org-comment-delimiter">#</span><span class="org-comment">darkgrey</span>
        printf <span class="org-string">"\e]P19f3f3f"</span> <span class="org-comment-delimiter">#</span><span class="org-comment">darkred</span>
        printf <span class="org-string">"\e]P9ff9f9f"</span> <span class="org-comment-delimiter">#</span><span class="org-comment">red</span>
        printf <span class="org-string">"\e]P23f9f3f"</span> <span class="org-comment-delimiter">#</span><span class="org-comment">darkgreen</span>
        printf <span class="org-string">"\e]PAbfefbf"</span> <span class="org-comment-delimiter">#</span><span class="org-comment">green</span>
        printf <span class="org-string">"\e]P3bf9f3f"</span> <span class="org-comment-delimiter">#</span><span class="org-comment">brown</span>
        printf <span class="org-string">"\e]PB9fff9f"</span> <span class="org-comment-delimiter">#</span><span class="org-comment">yellow</span>
        printf <span class="org-string">"\e]P45f5f9f"</span> <span class="org-comment-delimiter">#</span><span class="org-comment">darkblue</span>
        printf <span class="org-string">"\e]PC9f9fff"</span> <span class="org-comment-delimiter">#</span><span class="org-comment">blue</span>
        printf <span class="org-string">"\e]P59f3f9f"</span> <span class="org-comment-delimiter">#</span><span class="org-comment">darkmagenta</span>
        printf <span class="org-string">"\e]PDff9fff"</span> <span class="org-comment-delimiter">#</span><span class="org-comment">magenta</span>
        printf <span class="org-string">"\e]P63f9f9f"</span> <span class="org-comment-delimiter">#</span><span class="org-comment">darkcyan</span>
        printf <span class="org-string">"\e]PE9fffff"</span> <span class="org-comment-delimiter">#</span><span class="org-comment">cyan</span>
        printf <span class="org-string">"\e]P7afafaf"</span> <span class="org-comment-delimiter">#</span><span class="org-comment">lightgrey</span>
        printf <span class="org-string">"\e]PFffffff"</span> <span class="org-comment-delimiter">#</span><span class="org-comment">white</span>
        clear <span class="org-comment-delimiter">#</span><span class="org-comment">for background artifacting</span>
    <span class="org-keyword">fi</span>
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Choice for wayland/X11</span>
<span class="org-function-name">_rc_select_display_protocol</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    mkdir -p <span class="org-string">"${XDG_STATE_HOME:-${HOME}/.local/state}/runcom"</span>
    <span class="org-variable-name">default_proto</span>=<span class="org-string">"$(cat "${XDG_STATE_HOME:-${HOME}/.local/state}/runcom/graph_proto")"</span> 2&gt;/dev/null
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -z <span class="org-string">"${default_proto}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-variable-name">default_proto</span>=<span class="org-string">"non-graphical"</span>
    <span class="org-keyword">fi</span>
    <span class="org-variable-name">graph_avail</span>=<span class="org-string">"wayland x11 non-graphical"</span>
    <span class="org-variable-name">graph_avail</span>=<span class="org-string">"${default_proto}${graph_avail#*"</span>$<span class="org-rainbow-delimiters-depth-2">{</span><span class="org-variable-name">default_proto</span><span class="org-rainbow-delimiters-depth-2">}</span><span class="org-string">"} ${graph_avail%%"</span>$<span class="org-rainbow-delimiters-depth-2">{</span><span class="org-variable-name">default_proto</span><span class="org-rainbow-delimiters-depth-2">}</span><span class="org-string">"*}"</span>
    <span class="org-variable-name">graph_proto</span>=<span class="org-string">"$(_rc_select Display-Protocol "${graph_avail}")"</span>
    <span class="org-builtin">echo</span> <span class="org-string">"${graph_proto}"</span> &gt; <span class="org-string">"${XDG_STATE_HOME:-${HOME}/.local/state}/runcom/graph_proto"</span>
    <span class="org-builtin">unset</span> default_proto graph_avail
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Choice of window manager / desktop environment</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Args:</span>
<span class="org-comment-delimiter">#     </span><span class="org-comment">$1: protocol name</span>
<span class="org-function-name">_rc_select_proto_session</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-variable-name">proto_name</span>=<span class="org-string">"${1}"</span>
    <span class="org-variable-name">sessions_mem</span>=<span class="org-string">"${XDG_STATE_HOME:-${HOME}/.local/state}/runcom/${proto_name}_session"</span>

    <span class="org-variable-name">protoinitrc</span>=<span class="org-string">".xinitrc"</span>
    <span class="org-variable-name">sessions_dir</span>=<span class="org-string">"/usr/share/xsessions/"</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-string">"${proto_name}"</span> = <span class="org-string">"wayland"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-variable-name">protoinitrc</span>=<span class="org-string">".wayinitrc"</span>
        <span class="org-variable-name">sessions_dir</span>=<span class="org-string">"/usr/share/wayland-sessions/"</span>
    <span class="org-keyword">fi</span>

    <span class="org-variable-name">default_session</span>=<span class="org-string">"$(cat "${sessions_mem}")"</span> 2&gt;/dev/null
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -z <span class="org-string">"${default_session}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-variable-name">default_session</span>=<span class="org-string">"${protoinitrc}"</span>
    <span class="org-keyword">fi</span>

    <span class="org-comment-delimiter"># </span><span class="org-comment">shellcheck disable=SC2046</span>
    <span class="org-variable-name">sessions_avail</span>=<span class="org-string">"$(ls "${sessions_dir}")"</span>
    <span class="org-variable-name">sessions_avail</span>=<span class="org-string">"${default_session}${sessions_avail#*"</span>$<span class="org-rainbow-delimiters-depth-2">{</span><span class="org-variable-name">default_session</span><span class="org-rainbow-delimiters-depth-2">}</span><span class="org-string">"} ${sessions_avail%%"</span>$<span class="org-rainbow-delimiters-depth-2">{</span><span class="org-variable-name">default_session</span><span class="org-rainbow-delimiters-depth-2">}</span><span class="org-string">"*}"</span>
    <span class="org-variable-name">exec_session</span>=<span class="org-string">"$(_rc_select "${proto_name}"-sessions "${sessions_avail}")"</span>
    <span class="org-builtin">echo</span> <span class="org-string">"${exec_session}"</span> &gt; <span class="org-string">"${sessions_mem}"</span>
    <span class="org-builtin">unset</span> default_session sessions_avail
    <span class="org-builtin">unset</span> protoinitc
    <span class="org-builtin">unset</span> sessions_dir
    <span class="org-builtin">unset</span> proto_name
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>
