org/index.org
*** Interaction
#+BEGIN_SRC sh :tangle ../env/ui
  # main UI choice routine
  main () {
      nowtty="$(tty)"
      if [ ! "${nowtty#/dev/tty}" = "${nowtty}" ]; then
          _rc_exports_for_proxies
          if ${RUNCOM_LAUNCH_UI}; then
              if [ -z "${RUNCOM_SESSION}" ]; then
                  _rc_select_display_protocol
                  if [ "${graph_proto}" = "x11" ]; then
                      _rc_exports_for_x11
                      _rc_select_proto_session "${graph_proto}"
                      export RUNCOM_SESSION="${graph_proto}: ${exec_session}"
                      exec "${RUNCOMDIR}/bin/x11start" "${exec_session}"
                  elif [ "${graph_proto}" = "wayland" ]; then
                      _rc_exports_for_wayland
                      _rc_select_proto_session "${graph_proto}"
                      export RUNCOM_SESSION="${graph_proto}: ${exec_session}"
                      exec "${RUNCOMDIR}/bin/waystart" "${exec_session}"
                  fi
              fi
          fi
      fi
      unset nowtty graph_proto exec_session RUNCOM_SESSION
      _rc_clean_up_tty
  }

  main "$@"

#+END_SRC

* Calls
** bash
#+BEGIN_SRC bash :tangle ../dotfiles/.bash_login
  # netcheck source=.local/share/pspman/src/runcom/env/ui
  . "${RUNCOMDIR:-${HOME}/.runcom}/env/ui"
#+END_SRC

** zsh
#+BEGIN_SRC bash :tangle ../dotfiles/.zlogin
  # netcheck source=.local/share/pspman/src/runcom/env/ui
  . "${RUNCOMDIR:-${HOME}/.runcom}/env/ui"
#+END_SRC



#  LocalWords:  runcom org dnf RockyLinux RHEL CentOS apk Debian Ubuntu SuSE
#  LocalWords:  OpenSuSE zypper pacman Manjaro UNO symlinked symlinks UnStow
#  LocalWords:  unstow neo XDG virtualenv Virtualenv PDF Pandoc Org Docx ENV
#  LocalWords:  coreutils zsh utf LocalWords shrc bashrc zshrc RUNCOM gui venv
#  LocalWords:  RUNCOMDIR config ui env CONFIG zshrc zshprofile zlogin Init
#  LocalWords:  setopt bemenu gtk venv ksh csh
