docs/index.html

<div id="outline-container-org0b62500" class="outline-4">
<h4 id="org0b62500">Interaction</h4>
<div class="outline-text-4" id="text-org0b62500">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">main UI choice routine</span>
<span class="org-function-name">main</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-variable-name">nowtty</span>=<span class="org-string">"$(tty)"</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-negation-char">!</span> <span class="org-string">"${nowtty#/dev/tty}"</span> = <span class="org-string">"${nowtty}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        _rc_exports_for_proxies
        <span class="org-keyword">if</span> $<span class="org-rainbow-delimiters-depth-2">{</span><span class="org-variable-name">RUNCOM_LAUNCH_UI</span><span class="org-rainbow-delimiters-depth-2">}</span>; <span class="org-keyword">then</span>
            <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -z <span class="org-string">"${RUNCOM_SESSION}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
                _rc_select_display_protocol
                <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-string">"${graph_proto}"</span> = <span class="org-string">"x11"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
                    _rc_exports_for_x11
                    _rc_select_proto_session <span class="org-string">"${graph_proto}"</span>
                    <span class="org-builtin">export</span> <span class="org-variable-name">RUNCOM_SESSION</span>=<span class="org-string">"${graph_proto}: ${exec_session}"</span>
                    <span class="org-keyword">exec</span> <span class="org-string">"${RUNCOMDIR}/bin/x11start"</span> <span class="org-string">"${exec_session}"</span>
                <span class="org-keyword">elif</span> <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-string">"${graph_proto}"</span> = <span class="org-string">"wayland"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
                    _rc_exports_for_wayland
                    _rc_select_proto_session <span class="org-string">"${graph_proto}"</span>
                    <span class="org-builtin">export</span> <span class="org-variable-name">RUNCOM_SESSION</span>=<span class="org-string">"${graph_proto}: ${exec_session}"</span>
                    <span class="org-keyword">exec</span> <span class="org-string">"${RUNCOMDIR}/bin/waystart"</span> <span class="org-string">"${exec_session}"</span>
                <span class="org-keyword">fi</span>
            <span class="org-keyword">fi</span>
        <span class="org-keyword">fi</span>
    <span class="org-keyword">fi</span>
    <span class="org-builtin">unset</span> nowtty graph_proto exec_session RUNCOM_SESSION
    _rc_clean_up_tty
<span class="org-rainbow-delimiters-depth-1">}</span>

main <span class="org-string">"$@"</span>

</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgabadca6" class="outline-2">
<h2 id="orgabadca6">Calls</h2>
<div class="outline-text-2" id="text-orgabadca6">
</div>
<div id="outline-container-org2b57e88" class="outline-3">
<h3 id="org2b57e88">bash</h3>
<div class="outline-text-3" id="text-org2b57e88">
<div class="org-src-container">
<pre class="src src-bash"><span class="org-comment-delimiter"># </span><span class="org-comment">netcheck source=.local/share/pspman/src/runcom/env/ui</span>
. <span class="org-string">"${RUNCOMDIR:-${HOME}/.runcom}/env/ui"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9b85299" class="outline-3">
<h3 id="org9b85299">zsh</h3>
<div class="outline-text-3" id="text-org9b85299">
<div class="org-src-container">
<pre class="src src-bash"><span class="org-comment-delimiter"># </span><span class="org-comment">netcheck source=.local/share/pspman/src/runcom/env/ui</span>
. <span class="org-string">"${RUNCOMDIR:-${HOME}/.runcom}/env/ui"</span>
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>